{
    "104-10016-10021.txt": [
        {
            "cryptonym": "GPFLOOR",
            "context": "destruction, cite DIR INFO CNBR CITE MELB 2517 (ROLLOFIER ACTING) reasons and coordinate if appropriate. AVDAT GPFLOOR 2 DEC 63 IN 71187 REF DIR 85690 1. SQUARE PRELIMINARY CHECKS ON RECORDED CONVERSATIONS REVEAL FOLL:"
        }
    ],
    "104-10061-10115.txt": [
        {
            "cryptonym": "GPIDEAL",
            "context": "BRACTON (4) Michael M. CHOADEN (P) Paul D. LANGEVIN (P) (com). David A. PADDACK (A) 15 None 14-00000 1. GPIDEAL 2 LCIMPROVE 3. Gerald F. GESTETNER 4. JMJIP 5. LICALLA 6... Raymond H. GERENDE.. 7.. ODFOAM OK→ 8. LETAMIL"
        },
        {
            "cryptonym": "GPIDEAL",
            "context": "HORSFALL - Flosyan Rudolph HAROLD, DAHLGRE Yune() KARTY 11 may 650 280 nons microfits reaster ৬ 14-00000 GPIDEAL LCIMPROVE G. F. BESTETINERS ACCACER JMZIP/IX LICALLA GERENDE AC. .. 70 14-00000 • Monteres de Zuluett"
        }
    ],
    "104-10061-10207.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "having told him Oswald was an agent Leap spake to burn in Flouda FLORES, DANIEL STA. IN MEXICO Re AMMUG-1 HASHIMA, Robert S Contract emp to kyo Harris, Vergil L Tut 1858 E. Glencore St. Mesa, Avezana 82503"
        },
        {
            "cryptonym": "AMMUG",
            "context": "N. (BARNEY) Ret 403 Silver Rock Rd., 'Rockville, Md 20851 Tele: office: 340-9354 Home : 762-1417 Re AMMUG WAS SUPPOENED HICKS, CALVIN Ret. Med Dis 1608 Imperial Redge 1974 Lascruces. N. Meni 88001 485 (505)"
        },
        {
            "cryptonym": "AMMUG",
            "context": "Benedict Place Greenwich, Conn 068 30 Tele: office: (485) (203) 661-2000 EXT 667 Home : (203) 661-1146 Re: AMMUG approx date: port 25 July 1978: delerviewed Dr. Ma for 5 hours Stuckey, Mary Elizabeth Get 1958-Oct"
        }
    ],
    "104-10066-10107.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "STREET MIAMI, FLA. 33145 TEL (305) 858-4406. E2 IMPDET END OF MESSAGE SECRET IN 1631411 LMIM 29191 1 AMMUG-1 05645"
        }
    ],
    "104-10072-10228.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "P-6079 : ACCOM PLISHED APERTURE CARD REPRODUCTIO ૮. 14-00000 LITAMIL P On the night of 10 May 63, I mat LITAMIL-9 usual wondervous point and we droe to outlying district of uity where debriefing took place. NO SECURITY"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "política\"ero requiere por lo menos una o dos genera ciones ONE CARD BUBMITTED O LITANIE-9) On 14 May 63, I met (LITAMIL-9 at usual undervous point and we drove to outlying area to hold meeting, NO SECURITY PROBLEMS NOTEГ Time:"
        }
    ],
    "104-10102-10231.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "1963 (which would have been when he was screening names for the AMTRUNK Operation), one 01 from from (LITAMIL-9, LITAMIL-93 and the other from Fernando REY reported by 02 VASLOUCH-1. As mentioned above, these charges"
        }
    ],
    "104-10103-10350.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "as July 1963 (which would have been when he was screening names for the AMTRUNK Operation), one from LITAMIL-9, and the other from Fernando REY reported by VASLOUCH-1. As mentioned above, these charges could well"
        }
    ],
    "104-10170-10051.txt": [
        {
            "cryptonym": "GPIDEAL",
            "context": "In short, AMSPELL policy is to mold PBPRIME, public opinion and bring pressure to bear on ODYOKE and GPIDEAL for action in the PBRUMEN situation within the next four months. e. To implement such a policy, AMSPELL"
        }
    ],
    "104-10176-10073.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "FORK NO. : JUN 55 REPLACES FORM 59-92 688 WHICH MAY BE USED SOURCE RECORD (24) 3 PROJECT SOURCE SUBJECT LITAMIL-9 IP DATE OF INFORMATION Jaz 64 EATE ACQUIRED 30 Jan 64 FIELD DISTRIBUTION DATE GRADE TO 13 Feb 64 2 WASH,"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "by IG FORM NO. REPLACES FORM 59-92 JUN 55 688 WHICH MAY BE USED SOURCE RECORD (2) 2 PROJECT EP SCURCE LITAMIL-9 DATE OF INFORMATION 2 Mar 64 DATE ACQUIRED 1 Apr 64 FIELD DISTRIBUTION CATE GRACE 14 Apa 64 22 REPORT"
        }
    ],
    "104-10176-10075.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "DEATH OF SUBJECT. PER ARRB DECISION OF 13 MAY. AGENCY REQUIRED TO DETERMINE STATUS ANNUALLY. 201-329-609 LITAMIL-9 Res: Res: Y Y Duplicate Document Of: Component Review Info COMPONENT DATE TASKED DATE REVIEWED Sent"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "ALBERU-Souto, Luis SARIATIONS DATE CRIS. REO. 18 April 1967 SO-279039 POA CAC DA 54.1% CRYPTONYM PSELDONYM LITAMIL-9 DATE OF BIRTH 1915 CASE OFFICER PLACE OF FIRTH Oviedo, Spain DIVISION Jane F. Zerance WH/1/M REMARKS"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "OOSOLE (21) E2, 6-72 SECRET CLASSIFIED BY: IMPOET MEMORANDUM FOR: CI/OA SECRET ATTENTION : SUBJECT : LITAMIL-9 (201-329609) 24 August 1972 1.vior of Station files it was noted that LITAMIL-7's Operational Approval,"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "JMWAVE. ALSO PLEASE PROVIDE Ex UITABLE PRETEXT TO COVER WIFE'S CALL TO PROTECT SMABOVE SOURCE. A C101331 LITAMIL-9, REPORTED IN REF C THẤT KACIQUES WOULD PROBABLY BE WILLING COOPERATE WITH LAHARP IF APPROACHED. CAN"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "LITAMIL-9, REPORTED IN REF C THẤT KACIQUES WOULD PROBABLY BE WILLING COOPERATE WITH LAHARP IF APPROACHED. CAN LITAMIL-9 OBTAIN CURRENT ASSESSMENT PER MEΧΙ 2751. UPON RECEIPT PARA I INFO 2. FOR JMWAVE: IF MACIQUES EX WIFE"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "85742 ר WH COMMENT: *Abraham MACIQUES Maciques departing Mexico City 26 March for Montreal TTABULO ***LITAMIL-9 being believes MACIQUES willing cooperate if contacted. **** LITAMIL-9 willing provide assessment of"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "March for Montreal TTABULO ***LITAMIL-9 being believes MACIQUES willing cooperate if contacted. **** LITAMIL-9 willing provide assessment of MACIQUES if latter returns Cuba. WILLIAM B. BROE C/WHD BELEASING OFFICER"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "SIGNATURE SECRET GROUP! Eachuded fr doungrading and OVER UNCLASSIFIED. MTERNAL USE ONLY SUBJECT: (Optional) LITAMIL-9 FROM WH/1/Mexico/4 TO: (Officer designation, roons népiber, and bunding) tance 1. WH 2. 3. 4. CON.DENTIAL"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "after sach comme 329609 UNCLASSIFIED SECRET 6 February 1968 MEMORANDUM FOR: CI/OA ATTENTION: SUBJECT: LITAMIL-9 201-329609 Attached are two copies of a PRG Part I on Subject and a copy of the PRC Part II. An Operational"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "required for iten, use reverse side of page keyed to appropriate stea number. 3. CRYPTONYM 2- PSEUDONYM LITAMIL-9 SECTION I CONTACT AND DEVELOPMENT 1. INDICATE HOW, WHEN, WHERE, WHY, AND BY WHOM SUBJECT WAS FIRST CONTACTED"
        }
    ],
    "104-10180-10044.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "to Mexico ACTION REQUIRED REFERENCES Action: FYI Following is a translation of a report submitted by AMMUG-1 concerning a shipment of explcsives to Mexico: \"The Communist Party of El Salvador iad asked me to"
        },
        {
            "cryptonym": "AMMUG",
            "context": "NO NH SA 7 (1), NE 1 (2), CI 4, RID 1 1 OBSOLETE PRETEXT EDITIONS LIAISON 201-332665 22 No Project (AMMUG-1) CSCI-316714-6 Ima A CENTRAL INTELLIGENCE AGENCY This material contains information afecting the National"
        },
        {
            "cryptonym": "AMMUG",
            "context": "FCR THE RECORD EXCERPT : 24 July 1964 (info of May 1964) SUBJECT: General: Debriefing Report 126 of AMMUG/1 Specific: Identification of Cuban Passports and Other Fhotographs Source identified the photographs"
        },
        {
            "cryptonym": "AMMUG",
            "context": "identified the photographs of subjects and gave the following comments: ..... GAVILAN Rosales, Esther AMMUG identified subject as the wife of Rogelio RODRIGUEZ ( Lopez J. a DGI officer stationed in the Cuban"
        },
        {
            "cryptonym": "AMMUG",
            "context": "MEMORANDUM FOR THE RECORD 24 July 1964. (info of May 1964) SUBJECT: General: Debriefing Report #126 of AMMUG/1 Specific: Identification of Cuban Passports and Other Fhotographs Source identified the photographs"
        },
        {
            "cryptonym": "AMMUG",
            "context": "identified the photographs of subjects and gave the following comments: ..... GAVILAN Rosales, Esther AMMUG identified subject as the wife of Rogelio RODRIGUEZ ( Lopez J. a DGI officer stationed in the Cuban"
        },
        {
            "cryptonym": "AMMUG",
            "context": "FCR THE RECORD EXCERPT : 24 July 1964 (info of May 1964) SUBJECT: General: Debriefing Report 126 of AMMUG/1 Specific: Identification of Cuban Passports and Other Fhotographs Source identified the photographs"
        },
        {
            "cryptonym": "AMMUG",
            "context": "identified the photographs of subjects and gave the following comments: ..... GAVILAN Rosales, Esther AMMUG identified subject as the wife of Rogelio RODRIGUEZ ( Lopez J. a DGI officer stationed in the Cuban"
        },
        {
            "cryptonym": "AMMUG",
            "context": "MEMORANDUM FOR THE RECORD 24 July 1964. (info of May 1964) SUBJECT: General: Debriefing Report #126 of AMMUG/1 Specific: Identification of Cuban Passports and Other Fhotographs Source identified the photographs"
        },
        {
            "cryptonym": "AMMUG",
            "context": "identified the photographs of subjects and gave the following comments: ..... GAVILAN Rosales, Esther AMMUG identified subject as the wife of Rogelio RODRIGUEZ ( Lopez J. a DGI officer stationed in the Cuban"
        }
    ],
    "104-10183-10276.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "Only Do Not Reproduce Am 19 June 1964 MEMORANDUM FOR: Chief, WH/SA/CI VIA : Chief, WH/PO/A SUBJECT : AMMUG/1.Operation Target Analysis and Non-surfacable Leads 1. Reference is made to your memorandum date 16"
        },
        {
            "cryptonym": "AMMUG",
            "context": "and forwarded to your office. 26 John M. Whitten) C/WH/2 Attachments: Target Analysis Summary Reports AMMUG/1 Leads Not to be Disseminated Distribution: O & 1-C/WH/SA/CI (w/atts) 1 WH/PO/A (w/atts). 3 WII/2 (w/atts)"
        },
        {
            "cryptonym": "AMMUG",
            "context": "cely Ruben MART. Quardado CERRILLA MAKSAKE X TRAINING cuny TA ? Raul Concepcion Morales NO REGURD IN AMMUG-1 1096x 44/51/CI Jose MANCIA Martinez Gufe ILLA LAKFAME TRAINING CALY INDIVIDUAL NAMED RICARDO MART14F"
        },
        {
            "cryptonym": "AMMUG",
            "context": "GUERRILLA WARFARE TRAINING LWARFARE TRAINING onry Podro AR VALO Polar ALIAS OF JESUS ANTONIO PA ob 2 AMMUG-Kis-μιζόκιν 1-^ IN COUT』バす WITH SUSU Jorge Federico BAIRES] AGENT? Ana Leticia BAJLAZA (BARRAGAF) Quiroa"
        },
        {
            "cryptonym": "AMMUG",
            "context": "whereabouts, : 14-00000 Target Analysis Summary Report SUBJECT: Roque DALTON Garcia I. Significance of Target AMMUG/1 Operation DALTON is a recruited agent of the Cuban DGI. He has been trained in guerrilla warfare,"
        },
        {
            "cryptonym": "AMMUG",
            "context": "the Cuban DGI. He has been trained in guerrilla warfare, 8/v, radio transmission, and radio reception. AMMUG/1 claims that Subject is a member of the Central Committee of the PCES. ANNUG/1 characterized Subject"
        },
        {
            "cryptonym": "AMMUG",
            "context": "under surveillance. Exact address will be obtained by the San Salvadoran Station. III. Vulnerabilities AMMUG/1 lists Subject as his leading candidate for recruit- nent by us. His reasoning on this is that Subject"
        },
        {
            "cryptonym": "AMMUG",
            "context": "(unilateral penetration of 24 the police who might be used as a lead into Subject). VII. Evaluation From AMMUG-l's assessment of Subject, based on personal knowledge and observation, it would appear that Subject"
        },
        {
            "cryptonym": "AMMUG",
            "context": "against our use of him which would include, presumably, resumption of his s/w channel. Nonetheless, AMMUG-1's claim that Subject is a maber of the Central Committee of the PCES (nevs to us) makes his an operational"
        }
    ],
    "104-10183-10333.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "cilaps S DATE AND TIME FILED) TREFERENCE NUMBERY (PICA) 8 19 22 ZCITE DIRECTOR 58190 TO JMWAVE TYPIC AMMUG REF: JMWAVE 4480 (IN 54041) 29 1. RE PARA ONE REF ( INTER-UNIVERSITY COMMITTEE FOR POLITICAL AND SOCIAL"
        },
        {
            "cryptonym": "AMMUG",
            "context": "PROVIDES ALL INFO NECESSARY FOR WOGAME ANSWER CREDIT QUERIES. 2. RE PURCHASE OF HOME, HQS RECOMMENDS AMMUG/1 DEFER DECISION UNTIL QUESTION HIS WOFACT FUTURE DEFINITELY SETTLED. FYI: LANGOSCH HAS REQUESTED AMMUG/1"
        },
        {
            "cryptonym": "AMMUG",
            "context": "AMMUG/1 DEFER DECISION UNTIL QUESTION HIS WOFACT FUTURE DEFINITELY SETTLED. FYI: LANGOSCH HAS REQUESTED AMMUG/1 SERVICES (IN IN FRANKFURT FRANKFURT BUT QUESTION NOT YET DETERMINED. DISPATCH FOLLOWING. 24 END OF"
        }
    ],
    "104-10183-10335.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "26 ANFI ABSTRACT 6 DECから54041 1. MWAVE RECORDS SHOW FROM ARRIVAL JMWAVE LATE 64 THROUGH DECEMBER 65 AMMUG/1 ULD AS STATUS COVER 9 CINTER-UNIVERSITY COMMITTEE FOR POLITICAL AND SOCIAL ACTION) WHICH WAS PROVIDED"
        },
        {
            "cryptonym": "AMMUG",
            "context": "ACTION) WHICH WAS PROVIDED BY HEAD QUAT.TERS. JUS TITLE WAS RESEARCH- ER WITH SALARY $600 PER MONTH. AMMUG/1 CLAIMS NO KNOWLEDGE OF THE (BALI IMORE COMPANY AND SEARCH JMWAVE FILES FAILS 29 PRODUCE ANY INFO THAT"
        },
        {
            "cryptonym": "AMMUG",
            "context": "CLAIMS NO KNOWLEDGE OF THE (BALI IMORE COMPANY AND SEARCH JMWAVE FILES FAILS 29 PRODUCE ANY INFO THAT AMMUG/1 CONNECTED WITH ANY SUCH COMPANY. REES HOS CLARIFY. 2. AS IN CASEMBEROUS OT HER PBRUMEN AGENTS, JMWAVE"
        },
        {
            "cryptonym": "AMMUG",
            "context": "EMPLOYMENT THUS BEGAN 1 JAN 55. THERE WAS NO INTER IM EM PAYMENT. 3. SEVER AL OT HER CRED IT CHECKS SINCE AMMUG/1 EMPLOYED 29 BY SCHEAFFER HAVE WORKED SMOOTHLY. AMMUG/1 ATTEMPTING PURCHASE HOUSE LOCALLY WHICH APPEARS"
        },
        {
            "cryptonym": "AMMUG",
            "context": "PAYMENT. 3. SEVER AL OT HER CRED IT CHECKS SINCE AMMUG/1 EMPLOYED 29 BY SCHEAFFER HAVE WORKED SMOOTHLY. AMMUG/1 ATTEMPTING PURCHASE HOUSE LOCALLY WHICH APPEARS BE REASON FOR PRESENT C3 COPY SECRET 7 201-749651"
        }
    ],
    "104-10183-10355.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "BRANCH ALLAN, WH 8, DOP SECRET3122147 DEC 70 CITE DIRTECH 0697 IIMEDIATE WH/MIAMI INFO DIRECTOR TYPIC AMMUG AQUATIC REF: DIRTECH 3696 (IN IN 236095 IDENTITY MR. LESTER L RHODES SECRET. END OF MESSAGE 6718 EDSAL"
        },
        {
            "cryptonym": "AMMUG",
            "context": "1970 Wi/COG-70-447 MEMORANDUM FOR: Chief, CI/OA ATTENTION SUBJECT : Mr. Ruffner Amendment of OA for AMMUG/1 It is requested that the Operational Approval for AHMUG/1 (201-749651) be amended to permit his operational"
        }
    ],
    "104-10183-10366.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "DIRECTOR 201936 C 1...0 1. DURING THE YEARS THAT PACHANKIS HAS BEEN IN CONTACT WITH SLANK-1 (S-1), FORMERLY AMMUG 1, FROM 1965 TO 1978, PACHANKIS HAS HAD NO KNOWLEDGE THAT S-1 WAS EVER IN CONTACT WITH NVCANOPY. SINCE"
        },
        {
            "cryptonym": "AMMUG",
            "context": "HISTORY (BEGINNING WITH FOD) CONTR CAT, LOCATION PROJECT SALARY GRADE Apr 64-Nov 67 Agent B Washington, AMMUG $600 mo. D.C. & Miarji Jan 69-Present Informant B Miami, Fla. SLEEPER WAE 14-00000 SECURITY FACTORS"
        }
    ],
    "104-10185-10105.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "L/WASHABR111 11 TOTALS W/SA 7 (1), WE 1 (2), CI 4, RID 1 FG. NO. LIAISON 201-73713S LX-1650 NO PROJECT (AMMUG/1 CSCI-313//00701-6-4 COORDINATING, MIK: LD:swk C/R&A 14-00000 a report dated 19 October 1963, soce"
        }
    ],
    "104-10185-10110.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "16 MAR 1965, /SA 7 (1), 1 (2), CI 4 RID 1 201-747936 * OCR FBT 2 X-1645 CSCI-316/00399-64 NO PROJECT (AMMUG/L) COORDINATING RELCASING MK:LD:Swk. CLAREA 14-00000 3. Es wire sid.not accompany him and source speculated"
        }
    ],
    "104-10185-10117.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "HAMAYK TOTALE INFORMATION REPORT 11 CIALIA 2CL/BRA 3. LE CANADA LIAISON 201-33321 LX-1639 ND PROJECT (AMMUG 1) CSCI-316/00693-64 COORDINATING RELEAS RID/AN WH/SA 7 (1), WE 1 (2), CI 4, RID 1 WUK: LD:wk CLARSK"
        }
    ],
    "104-10185-10228.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "KENNEDY ASSASSINATION RECORDS ACT OF 1992 Up A1900/1 1 July 1964 Nemo for the Records On 1 July 1964 AMMUG was transferred from safehouse #2 to the new apartment located 24 at (@500 14th Street, Silver Springs,"
        }
    ],
    "104-10185-10234.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "PRESIDENT JOHN F. KENNEDY ASSASSINATION RECORDS ACT OF 1992 MEMORANDUM FOR THE RECORD SUBJECT: SAFEHOUSE FOR AMMUG-1 03 16 June 1964 1. The undersigned called Mr. (John Ryan of the Safehouse on 15 June 1964 Procurement"
        },
        {
            "cryptonym": "AMMUG",
            "context": "Mr. (John Ryan of the Safehouse on 15 June 1964 Procurement Section to arrange for the Safehouse for AMMUG-1 8484 24 at Summit Hill Apartments, 16th Street, Silver Spring, Maryland. 03 2. Mr. (Ryan called on"
        }
    ],
    "104-10185-10243.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "MEMO FOR THE RECORD SUBJECT: IN &S CARD 30 June 1964 Called Mr. Knott in the Alien Affairs Staff for AMMUG-l's INS card. He will check with them to see if things are moving. A far as he knows they are trying"
        },
        {
            "cryptonym": "AMMUG",
            "context": "border. ect for 10AM 2 July for furiceprint appt Ament se m 24 SUBJECT: SAFE APARTMENT AT/SUMMIT HILL) AMMUG-1 to move in on the 1st of July. Called there today to check if everything is ready. Will pick up lease"
        }
    ],
    "104-10185-10248.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "OF 1992 SECRET MEMORANDUM FOR THE RECORD Kit by 20 May 1964 SUBJECT: REJECTION OF AN APARTMENT FOR AMMUG-1 24 1. The apartment at Hunting Towers, Apt #731 West, Mount Vernon Avenue (Blvd.), Alexandria, Virginia"
        },
        {
            "cryptonym": "AMMUG",
            "context": "Winston. 2. Due to the foregoing we find it necessary to request that another apartment be secured for AMMUG-1. Distribution: 1- WH.SA/Logistics AMMUG-1 File 1 = WH SA/CI Chrono 6. C ভাল SECRET likube Harold F."
        },
        {
            "cryptonym": "AMMUG",
            "context": "necessary to request that another apartment be secured for AMMUG-1. Distribution: 1- WH.SA/Logistics AMMUG-1 File 1 = WH SA/CI Chrono 6. C ভাল SECRET likube Harold F. Swenson Chief, WH/SA/CI 20 MAY 1964 19-6-102/2"
        }
    ],
    "104-10185-10252.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "JOHN F. KENNEDY ASSASSINATION RECORDS ACT OF 1992 14 May 1964 Kecorandum for the Record: Safehouse for AMMUG-1 03 له Mr. Ray Scofield) this 1. Per verbal agreement with Mr. (Ray ة this date, it was decided to"
        }
    ],
    "104-10185-10253.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "DEFERRE CEN ROUTINE DDP, CI,CI/OPS, FI, TSD 6, WH 7, VR PRITY TO XXXXXXXX MEXI INFO AQUATIC PBRUMEN AMMUG ΚΧΑΚΟΧΧΑΚΗΣ REF: MEXI 9336 (IN 78050) * IN 81839 CITE DIR 20506 1. KURIOT PREPARING TWO DOCUMENTS FOR"
        }
    ],
    "104-10185-10315.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "ADDP, C/CI, C/FI 2, C/TSD 3, C/W.1 5, VR 7N78050 SECRET 717532 IMMEDIATE DIR CITE MEXI 9336 RYBAT TYPIC AMMUG REF DIR 19477 1. SEE NO DIFFICULTY REF PLAN. MEXI OFFICER CAN CARRY LETTER AND INSTRUCTIONS TO MNTY."
        }
    ],
    "104-10186-10004.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "SECRET 021952Z CITE MONTEVIDEO 5282 1. IF REFERENCE REQUEST CARRIED OUT WISH CONSIDER 3 Nov 885636 HAVING AMMUG-1 ALSO VISIT MONTEVIDEO FOR SIMILAR PRESENTATION. IF PLAN FEASIBLE, REQUEST EVALUATION AMMUG-I'S POTENTIAL"
        },
        {
            "cryptonym": "AMMUG",
            "context": "HAVING AMMUG-1 ALSO VISIT MONTEVIDEO FOR SIMILAR PRESENTATION. IF PLAN FEASIBLE, REQUEST EVALUATION AMMUG-I'S POTENTIAL IMPACT, BOTH AS PERSON AND TIMELINESS HIS INFORMATION, FOR PRESENTATION 06 06 CHIEF OF"
        }
    ],
    "104-10186-10021.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "(12.0433) २१ 19 Ara 57: 67 48874 (SUBJECT REF A NOT YET LOCATED BY NATIONAL GUARD BUT STATION YOULD LIKE AMMUG-1 TO STAND BY IF POSSIBLE FOR THIS AND OTHER OPERATIONAL POSSIBILITIES INVOLVING DGI TRAINED SALVADORANS"
        },
        {
            "cryptonym": "AMMUG",
            "context": "PREFERS COMPLETELY UNILATERAL PITCH. AS SOON AS GOMEZ IS RELEASED AND 16-20 RELOCATED, WE WILL REQUEST AMMUG-1 PRESENCE SAN SALVADOR TO MAXE UNILATERAL PITCH. IF IT BECOMES NECESSARY TO FALL BACK ON JOINT RECRUITMENT"
        }
    ],
    "104-10186-10088.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "indicated by \"#\".) INFORMATION REPORT INFORMATION REPORT For Distribution See Attached Page LX-2307 NP (AMMUG-1) CS-311/01258-63 ONE SY FBI DIA - 2 eachCOORDINATING RELEASING CLALS (for AF/OSI, ACSI TOTALSIE 3,CI"
        }
    ],
    "104-10186-10099.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "GROUP 2 1 FBI 2 INFORMATIONEREPORT INFORMATIONOREPORTA For Distribution See Attached Page LX-2158 NP (AMMUG-1) CS-311/00466-65 CI/LS TOTALS 12 (for AF/OSI, ACSI, ONE, SY, FBI, DIA 2 each COORDINATING REAVE SING"
        }
    ],
    "104-10186-10235.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "WH/SA 7 (1), WE 1 (2). CI 4, RID 1 WH WAVE. 11 TOTALS 4/1 LIAISON 201-265067 LX-1693 LX-159, NO PROJECT(AMMUG/1) _ CSCI-316/01228-64 COORDINATINGH FilGo WMK:Dwk 14-00000 SECRET NO FOREIGN DISSEN CSCI-316/01228-64"
        }
    ],
    "104-10186-10264.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "MISA MOBINE MADR 2 CLRAA. MSAR 1 TE CANADA SIE BRITISHLI HASHIBR THSA CLA RIDEAN L MLMAVE 1 NO PROJECT(AMMUG/1 CSCI-316//00701-64 00030INATING 4IBR 14-00000 i : 3. SECRET NO FOREIGN DISSEN -2- In a report dated"
        }
    ],
    "104-10186-10308.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "indicated by \"#\") INFORMATION REPORT INFORMATIONEREPORT For Distribution See Attached Page LX-2307 NP (AMMUG-1) CS-311/01258-65 CLALS 12 for AFOSI, ACSI, OSI SY, FBL1DIA - 2 each COORDINATING RELOSING TOTALIE"
        }
    ],
    "104-10186-10309.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "RIDAN 1,WH/SA 16(5), SR 4.FI BLIAISON WH 23 (33), AF 8(8), EE 8(10). FE 12(8), NẺ 7(19) LX-2158 NP (AMMUG-1) CS-311/00466-65 2 cachooRDINATING REME SING 3RWT ch 14-00000 S-E-C-R-E-T NÓ FOREIGN DISSEM la CS-311/00-466-65"
        }
    ],
    "104-10186-10382.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "Station, Cadrid 15-27 Chief of Base, Barcelona; Chief, NE Chief of Station, JiWAVE-- SUBJECT Operational AMMUG/1 Identification of Manuel ESTEVEZ Perez ACTION REQUIRED REFERENCES 4. XXX.MED ة S DESA CAN MENING ABSTRACT"
        },
        {
            "cryptonym": "AMMUG",
            "context": "information and files. ACTION REQUIRED: Reference: OSBW 1022 23 1. As requested in paragraph 2 of reference AMMUG/1 was queried for any information he might have on Manuel ESTEVEZ Perez. AMMUG/1 was unable to identify"
        },
        {
            "cryptonym": "AMMUG",
            "context": "paragraph 2 of reference AMMUG/1 was queried for any information he might have on Manuel ESTEVEZ Perez. AMMUG/1 was unable to identify the name. 15-22 2. Barcelona: If a photograph of the Subject is available,"
        },
        {
            "cryptonym": "AMMUG",
            "context": "Barcelona: If a photograph of the Subject is available, it is suggested that a copy be sent to HAVE to show AMMUG/1 for possible identification. Distribution: - WH/C 11/15-2 2 2 - 2 2 - COSMADR COL Barcelona 15-27"
        }
    ],
    "104-10187-10149.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "CA/PEG, CA/PRIPCI, CI/PSI c1/1c 2, 01/11g Fij ces 3, UR ( SALY GUAT #40 CITE DIR 0 P .Y DYVOUR PORUMEN AMMUG REF DIR 45535 STAFF EMPLOYEES R 1 COPY R 0 J 1. 45536 SCHWILL TRAVEL SALV AND GUAT UPON COMPLETION TEGU"
        },
        {
            "cryptonym": "AMMUG",
            "context": "REQUEST ADDRESSEES VIEWS SUCH CONTACTS. EMROYEE 2. FOR SALV: M WILL EXPLORE WITH YOU POSSIBLE PITCHES TO AMMUG LEADS, PENDING OUTCOME SUCH EXPLORATIONS, IDQS PREPARED MAKE AMMUG ONE AVAILABLE IMMEDIATELY FOR PITCHES."
        },
        {
            "cryptonym": "AMMUG",
            "context": "EXPLORE WITH YOU POSSIBLE PITCHES TO AMMUG LEADS, PENDING OUTCOME SUCH EXPLORATIONS, IDQS PREPARED MAKE AMMUG ONE AVAILABLE IMMEDIATELY FOR PITCHES. ROUTING INITIAL RID/AN END OF MESSAGE RIDIS ) 0 Y R ) ! CD C/WH/PO/A"
        }
    ],
    "104-10187-10208.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "16400(mplije DOR, CI, CICOS, CI/IC 2, CI/RA, FI, WE 6, MUSA 3, AR SECRET 0223352 PRIORITY DIR CITE PACY 3363 AMMUG REF: A. DIR 13730 * 1,14 8. OTTA 1639 (65) ここは SOLING 4. 53 3 S کند STS 2574652 C/S COMMENT: REQUESTED"
        }
    ],
    "104-10215-10200.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "Units Use Pseudo) TFW/FI (Div. or Branch) Transmitted herewith is an Outgoing SW Message prepared for: AMLASH/1 (Cryptonym of Agent) Message No.:#1 This message is located: On the side of the paper that has the"
        }
    ],
    "104-10216-10000.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "80 DIRECTOR 627921. : i SECRET STAFF 0420522 DIRECTOR 627924 TO: PRIORITY MADRID. 2 WNINTEL RY AKULE AMLASH REF: MADRID 48679 3918232 1. DEPT OF STATE HAS SENT MESSAGE TO CONSULATE AUTHORIZING THE GRANTING OF"
        },
        {
            "cryptonym": "AMLASH",
            "context": "MADRID 48679 3918232 1. DEPT OF STATE HAS SENT MESSAGE TO CONSULATE AUTHORIZING THE GRANTING OF VISAS TO AMLASH FAMILY, BUT HAS APPARENTLY ATTACHED A PROVISO SO LONG AS CONSULAR OFFICER SATISFIED THAT THEY ARE BONA"
        },
        {
            "cryptonym": "AMLASH",
            "context": "PRACTICE AND BE LESS NEWSWORTHY THAN COULD BE THE CASE IN THE UNITED STATES. THE DEBRIEFER BELIEVES AMLASH-1 MEANT WHAT HE SAID. 2. FILE: 201-252234. RVN 4 MAR 00, DRV 090.1. ALL SECRET.> ORIG: ADC/LA/DPS (PALMER"
        }
    ],
    "104-10216-10001.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "271804Z FEB 80 SECRET 271748Z FEB 80 STAFF CITE MADRID 48680 TO: PRIORITY DIRECTOR. NINTEL RYBAT AKULE AMLASH REF: MADRID 48679 3918232 IDUNS: 1. 0 OIDEN TO MADR-48679 IN 3918225 MADR 48680 WIFE: \"IRTA NOVOA DELGADO,"
        }
    ],
    "104-10216-10002.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "SECRET STAFF 0222112 DIRECTOR 583488 ТО: ІММЕLIATE MADRID. NINTEL KATANLASH 1. LNERGO HAS ADVISED THAT AMLASH/1 (A/1) (IDEN A), CUBAN ASSET 1903-1905, ARRIVED MADRID 11 DEC 79 AND CONTACTED LINERGO SOURCE IN U.S."
        }
    ],
    "104-10216-10202.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ROUTING 5 6 7 8 TO PARIS FROM DIRECTOR CONE, De/wH/SH 3 TO PARI INTO DOP,Ve INFO SITIZED TYPIC YOBITE AMLASH UNSNAFU REF: PARI 5922 (IN 57147)* NO IDEN HQS TRACES CANTO. END OF MESSAGE 4 250661 13 192 SIC CEL"
        },
        {
            "cryptonym": "AMLASH",
            "context": "HQS TRACES CANTO. END OF MESSAGE 4 250661 13 192 SIC CEL CITE DIR 44517 WH/SA/COMMENT: *Ref XX RYBAT. AMLASH-1 fre 201-252234 WH/SA/EOB W. Wainwright (by phone) WE/SA/INT 54321 Homeo. Thale WILLIAM D. OʻRYAN C/WE"
        }
    ],
    "104-10216-10234.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "104-10216-10234 2025 RELEASE UNDER THE PRESIDENT JOHN F. KENNEDY ASSASSINATION RECORDS ACT OF 1992 SECRET AMLASH-1 1 July 1964 F MEMORANDUM FOR THE RECORD SUBJECT: Test of Open Sight Hood for 7.62um Belgium (FAL)"
        }
    ],
    "104-10216-10238.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "INEL-CA CIVERS Cifra FI S ECRET 281046Z AMLASAL X-Contiilo DIR CITE MADR 2662 (CROWERY ACTING) TYPIC AMLASH REF DIR 73234 20049750 1. RE PARA 2 REF, CIS CONTACT IS LU. MANUEL CANTILLO TOIRAC, NEW SECOND SECRETARY"
        }
    ],
    "104-10216-10273.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "Secondary objectives are to bring into the lufil area a cache of weapons and explosives for AMTRUNK-10/AMLASH-1 and to teach a system of S/W to one or more assets in the area. The tean is to be composed of the"
        }
    ],
    "104-10216-10338.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "200 FLEUR; OOP, AinDD, C/WE 3, C/CI: INPO CIR DER 95504 10 PRITY PARI DESENSITIZED CAT PERUMEN UNSNAFU AMLASH AMTHIP REF: PARI 9995 (IN 29053)* 1. DO NOT BELIEVE UNSKAPU/9 FIRING IN ITSELF A HAZARD TO AMLASH/1."
        },
        {
            "cryptonym": "AMLASH",
            "context": "UNSNAFU AMLASH AMTHIP REF: PARI 9995 (IN 29053)* 1. DO NOT BELIEVE UNSKAPU/9 FIRING IN ITSELF A HAZARD TO AMLASH/1. HOWEVER, DO FEEL IT NECESSARY ATTEMPT DETERMINE BACKGROUND TO UNSNAFU/19 STATEMENT THAT U/9 WAS \"DIRTY"
        }
    ],
    "104-10216-10397.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ROUTING Se a526 Jum 65 13090 IUNGO UR PILE ADDA C/WE 3. C/CI-C/F12 SIG CEN २ ROME DESENSITIZED PEAT TYPIC AMLASH REFS: A. DIR 22113 INFO B. ROME 6642 (IN 98023) C. ROME 6652 (IN 98586) ever he 23142 Mr. Harte progerly"
        },
        {
            "cryptonym": "AMLASH",
            "context": "INFO B. ROME 6642 (IN 98023) C. ROME 6652 (IN 98586) ever he 23142 Mr. Harte progerly Doesn't can't En AMLASH-1 Know that much about him. 1. BACKGROUND THIS CASE TOO EXTENSIVE TO RELAY. HOWEVER, PLAN HAVEJOSEPH"
        },
        {
            "cryptonym": "AMLASH",
            "context": "REGIONAL SER VISIT ROME TO BRIEF PRESLAND, PROBABLY IN AUGUST. CASEOPAILE) 5 2. NO DEFINITE EVIDENCE AMLASH COMPLEX PART OF DOUBLED OP BUT CERTAINLY AN INSECURE ONE. REF A WAS DESIGNED TO PRESENT CURRENT HOS"
        },
        {
            "cryptonym": "Amlash",
            "context": "THOMAS F.THIELE C/WE/INT/ BELEADING OFFICER END OF MESSAGE C/WH/C/FI WE/4 S. Munger (by phone) 25-34 Amlash-IDESDE COORDINATOR OPPAGERR SECRET/RYBAT GROUP! DESMOND FITZGERALD NOVATUES THAN THE ISSUING OFFICE"
        }
    ],
    "104-10216-10398.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ASSASSINATION RECORDS ACT OF 1992 MET 15 February 1965 MEMORANDUM FOR THE RECORD SUBJECT: Meeting with AMLASH-1 in Paris, 31 January to 3 February 1965 1. AMLASH-1 returned from Rome to Paris on 31 Jan 1965 and"
        },
        {
            "cryptonym": "AMLASH",
            "context": "MEMORANDUM FOR THE RECORD SUBJECT: Meeting with AMLASH-1 in Paris, 31 January to 3 February 1965 1. AMLASH-1 returned from Rome to Paris on 31 Jan 1965 and was set for a very brief meeting the same night by"
        },
        {
            "cryptonym": "AMLASH",
            "context": "were discussed at the two meetings on 1 and 2 February 1965: a. The primary reason for again meeting AMLASH-1 before his planned return to Cuba was to brief him on the security implications involved in the infiltration"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Vedado, Havana. Orozco's capture, if he has been captured, presents an indirect threat to the security of AMLASH-1 and a more direct threat to the security of AMTRUNK-10 since Orozco in Jan 1964 exfiltrated through"
        },
        {
            "cryptonym": "AMLASH",
            "context": "1964 exfiltrated through the rat line established by AMICE-14 (Miguelito). Upon his return to Cuba, AMLASH-1 will check the above with AMTRUNK-10; and, if Orozco is under the control of the security service,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Orozco is under the control of the security service, will decide and communicate with Miami whether AMLASH-1 and AMTRUNK-10 believe it necessary to exfiltrate AMTRUNK-10. AMLASH-1 was briefed to send a letter"
        },
        {
            "cryptonym": "AMLASH",
            "context": "communicate with Miami whether AMLASH-1 and AMTRUNK-10 believe it necessary to exfiltrate AMTRUNK-10. AMLASH-1 was briefed to send a letter to UNSNAFU-9 to indicate whether Orozco has been arrested or whether"
        },
        {
            "cryptonym": "AMLASH",
            "context": "service. If the letter talks aboutá long, tiring trip, this will indicate that Orozco has been arrested. AMLASH-1 was also requested to send a report on the above and any complications which have developed or may"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the above and any complications which have developed or may develop from Orozco's infiltration. b. AMLASH-1 suggested that his nom de guerre \"Charles,\" which we have been using for the past three years, be"
        },
        {
            "cryptonym": "AMLASH",
            "context": "\"Charles,\" which we have been using for the past three years, be changed to \"Gerardo.\" SECRET 14-00000 -2- c. AMLASH-1 was given a resupply of S/W developer pills and carbon. He planned to take the S/W material back with"
        },
        {
            "cryptonym": "AMLASH",
            "context": "resupply of S/W developer pills and carbon. He planned to take the S/W material back with him to Havana. AMLASH-1 again reviewed with UNSNAPU-9 and reminded UNSNAFU-9 to turn over to his Paris case officer all letters"
        },
        {
            "cryptonym": "AMLASH",
            "context": "reminded UNSNAFU-9 to turn over to his Paris case officer all letters regardless of how received from AMLASH-1 to either UNSNAFU-9 or letters that may be addressed/ to his parents-in-law. AMLASH-1 also agreed"
        },
        {
            "cryptonym": "AMLASH",
            "context": "received from AMLASH-1 to either UNSNAFU-9 or letters that may be addressed/ to his parents-in-law. AMLASH-1 also agreed to send S/W out in letters addressed to Juan Ventura (AMUHIP-1's business partner) in"
        },
        {
            "cryptonym": "AMLASH",
            "context": "partner) in Geneva or Rome. AMWHIP-I was briefed to inform Ventura that any letters he received from AMLASH-1 should be immediately air mailed to AMWHIP-1 in New York. Since AMLASH-1 will probably find it necessary"
        },
        {
            "cryptonym": "AMLASH",
            "context": "any letters he received from AMLASH-1 should be immediately air mailed to AMWHIP-1 in New York. Since AMLASH-1 will probably find it necessary some time not to sign the letters to Ventura in his true name, AMWHIP-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "any letter received from Cuba addressed to him and signed by a person unknown to him. S/W letters to AMLASH-1 should continue to be addressed to Ernestina Acosta, Edf. No. 526, Apt. 8, Esquina Calles 25 y H."
        },
        {
            "cryptonym": "AMLASH",
            "context": "Ernestina Acosta, Edf. No. 526, Apt. 8, Esquina Calles 25 y H. In an emergency a letter can also be sent to AMLASH-1's mother. d. AMLASH-1 was again debriefed on the cache that had been put down for him in Matanzas."
        },
        {
            "cryptonym": "AMLASH",
            "context": "526, Apt. 8, Esquina Calles 25 y H. In an emergency a letter can also be sent to AMLASH-1's mother. d. AMLASH-1 was again debriefed on the cache that had been put down for him in Matanzas. He repeated what he had"
        },
        {
            "cryptonym": "AMLASH",
            "context": "in the WAVE cable. A cable on this subject was sent from Paris to Headquarters, info WAVE, on 2 Feb. AMLASH-1 was requested to send a message either through his channel or through AMTRUNK-10's S/W channel reporting"
        },
        {
            "cryptonym": "AMLASH",
            "context": "channel reporting how much of the radio equipment and other material had been recovered from the cache. e. AMLASH-1 was asked if he knew of any individual in Cuba whom he could recruit and who could be inserted into"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Intelligence Service with the idea of attempting to get the DGI to assign this man to Caracas, Venezuela. AMLASH-1 could think of only one possibility, an individual known as Gustavo Gonzalez. AMLASH-1 has full confidence"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Caracas, Venezuela. AMLASH-1 could think of only one possibility, an individual known as Gustavo Gonzalez. AMLASH-1 has full confidence in Gustavo and Gustavo has previously been approached on several occasions by"
        },
        {
            "cryptonym": "AMLASH",
            "context": "has previously been approached on several occasions by Pinero to work for him. Upon his return to Cuba AMLASH-1 will check to find out if Gustavo can still get himself recruited by Pinero and then be sent on a"
        },
        {
            "cryptonym": "AMLASH",
            "context": "(AMWHIP-1, who also knows Gustavo, will provide the background infor- mation upon his return to New York.) 1. AMLASH-1 reported on the upcoming FEU elections on 10 February 1965. AMLASH-1 stated that Crombet, the president"
        },
        {
            "cryptonym": "AMLASH",
            "context": "upon his return to New York.) 1. AMLASH-1 reported on the upcoming FEU elections on 10 February 1965. AMLASH-1 stated that Crombet, the president of the Communist Youth, will become the new SECRET 14-00000 L -3-"
        },
        {
            "cryptonym": "AMLASH",
            "context": "would be one of the vice-presidents. (A cable on this subject was sent to Headquarters from Paris.) g. AMLASH-1 was requested to check with Fizzolo regarding the precautions being taken to prevent sabotage of the"
        },
        {
            "cryptonym": "AMLASH",
            "context": "from the factory to the port, and do they run the locomotives under their own power or are they towed. AMLASH-1 agreed to attempt to develop answers to the above requirements and pass the information to his contact"
        },
        {
            "cryptonym": "AMLASH",
            "context": "develop answers to the above requirements and pass the information to his contact in the Paris Station. AMLASH-1 also agreed to attempt to find out and pass to the Paris Station through UNSNAFU-9 the names of the"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the Cuban techs training at La Rochelle. h. In a general discussion regarding the persons with whom AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "discussion regarding the persons with whom AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1 stated he had received a letter from Portela and had in turn written"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1 stated he had received a letter from Portela and had in turn written to Portela. He considers Portela"
        },
        {
            "cryptonym": "AMLASH",
            "context": "written to Portela. He considers Portela a friend which was the only reason for writing to him. 1. AMLASH-1 was debriefed on Cuban Intelligence Service personnel. A cable on this subject was sent from Paris"
        },
        {
            "cryptonym": "AMLASH",
            "context": "suggesting WAVE send a S/W letter to ANTRUNK-10 stating: \"Este tranquilo. Carlos regresa pronto.\" k. AMLASH-1 was asked for information on the fol- lowing persons: (1) Samuel Gonzalez Rodriguez-Planes. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 was asked for information on the fol- lowing persons: (1) Samuel Gonzalez Rodriguez-Planes. AMLASH-1 reports he is a member of the Ameijeiras group and is a good and brave man. (2) Antonio Lusson y"
        },
        {
            "cryptonym": "AMLASH",
            "context": "man. (2) Antonio Lusson y Batlle, Chief of Operations of the General Staff of the Occidental Army. AMLASH-1 reports Lisson is an independent and rare type individual who keeps to himself and doesn't involve"
        },
        {
            "cryptonym": "AMLASH",
            "context": "independent and rare type individual who keeps to himself and doesn't involve himself in political matters. AMLASH-1 has heard nothing bad about Lusson. SECRET 14-00000 15000 -4- ; : اربره ها (3) Cndte. Raul Diaz Arguelles,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "of Artillery of the Occidental Army. (4) Elpidio Baez Bigo. Baez is a trusted Fidelman, According to AMLASH-1, (5) Luis Manuel Cantillo Toirac. Assigned to the Cuban Embassy in Madrid and one of the security"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the request of Ambassador Carrillo. 1. Gastro enteritis, water pollution and unsanitary conditions. AMLASH-1 states there are no real problems, although the scarcity and lack of a balanced diet do cause some"
        },
        {
            "cryptonym": "AMLASH",
            "context": "water has been a problem which probably has been the cause of some of the sickness in the country. n. AMLASH-1 did not believe that Aragones had invited hin to fly back to Havana with him in order to get him back"
        },
        {
            "cryptonym": "AMLASH",
            "context": "hin to fly back to Havana with him in order to get him back because of any serious security matter. AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared"
        },
        {
            "cryptonym": "AMLASH",
            "context": "him back because of any serious security matter. AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba."
        },
        {
            "cryptonym": "AMLASH",
            "context": "return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1 was unable to provide any information on the political developments"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1 was unable to provide any information on the political developments in Cuba in mid-November and December"
        },
        {
            "cryptonym": "AMLASH",
            "context": "developments in Cuba in mid-November and December since he had been out of the country since early November. AMLASH-1 was asked to check on the problems between the opposing factions in the Cuban leadership and explained"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the heir apparent to Fidel. Next to Raul is Che Guevara. After that, no other official, according to AMLASH-1, has any great influence in the making of Cuban national policy. President Dorticos' relationship"
        },
        {
            "cryptonym": "AMLASH",
            "context": "small role in the political field. He is serious and very hard worker, one of the few, according to AMLASH-1, who has worked seven days a week without leave since the revolution, Emilio Aragones holds an important"
        },
        {
            "cryptonym": "AMLASH",
            "context": "been accused of organizing former 13th of Harch Revolutionary Directorate people, but, according to AMLASH-1, this probably based on the fact that Chomon always gives jobs in the ministry he heads to DR people."
        },
        {
            "cryptonym": "AMLASH",
            "context": "to hold important positions in the regime are Alberto Mora, Ambassador Carrillo and Jose Naranjo. q. AMLASH-1 and AMWHIP-1 were unable to develop any specifics, but from their conversations with Ambassador Carrillo"
        },
        {
            "cryptonym": "AMLASH",
            "context": "had not been made as of November 1964 as to location. L SECRET أحمد الثوم 4-00000 A 7. SECRET -6- 8. AMLASH-1 again reported that he feels Orlando Blanco, Consul of the Cuban Embassy in Bern, is approachable"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Blanco, Consul of the Cuban Embassy in Bern, is approachable since he is unhappy with the Cuban regime. AMLASH-1 also feels that Enrique Rodriguez Loeches, Cuban Ambassador in Pabat, is approachable if approached"
        },
        {
            "cryptonym": "AMLASH",
            "context": "right person. Marina Garcia Gonzalez assigned to the commercial section of the Cuban Embassy in Rabat, AMLASH-1 feels is also approachable and feels money can be used as an inducement. Ambassador Carrillo, AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 feels is also approachable and feels money can be used as an inducement. Ambassador Carrillo, AMLASH-1 feels, if the proper person developed him, could probably be compromised with Fidel. He is a character"
        },
        {
            "cryptonym": "AMLASH",
            "context": "could probably be compromised with Fidel. He is a character and could easily be entangled according to AMLASH-1 in a compromising situation, Ambassador Carrillo is a close friend of Lucy Echevarria. 2. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 in a compromising situation, Ambassador Carrillo is a close friend of Lucy Echevarria. 2. AMLASH-1 was also asked information on a long list of other requirements on Cuba. On many he was unable to"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Headquarters on the requirements on which he did provide information. cc: File: WH/EA/EOB WHISAL MOB AMLASH-1 201 Internal Op SECRET Nestor D. Sanchez WH/SA/AMWORLD P"
        }
    ],
    "104-10221-10004.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "His 201 file reflects facts but not impressions. He apparently is known personally by LICOOKY-1 and LITAMIL-9 in Mexico City, and these two sources should be queried. SECRET SECRET 21 February 1965 VICTOR RICO"
        }
    ],
    "104-10225-10035.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "DIRECTOR 57011 749051 60LC554041 1. JAVE RECORDS SHOW FROM ARRIVAL JMWAVE LATE 64 TROUGH DECEMBER 65 AMMUG/1 UND AS STAT US COVER INTER-UNIVERSITY COMMITTEE FOR POLITICAL AND SOCIAL ACTION, WHICH WAS PROVIDED"
        },
        {
            "cryptonym": "AMMUG",
            "context": "ANMUG/1 CLAIMS NO KNOWLEDGE OF THE BALTIMORE COMPANY, AND SEARCH JMWAVE FILES FAILS PRODUCE ANY INFO THAT AMMUG/1 CONNECTED WITH ANY SUCH COMPANY. BEQUEST HOS CLARIFY. 2. AS IN CASE XMBEROUS OT HER PERUMEN AGENTS,"
        },
        {
            "cryptonym": "AMMUG",
            "context": "EMPLOYMENT IHUS BEGAN 1 JAN SS THERE WAS NO INTER IM EM PAYMENT. 3. SEVERAL OTHER CRED IT CHECKS SINCE AMMUG/I EMPLOYED BY SCHEAFFER HAVE WORKED SMOOT HL Y. AMMUG/1 ATTEMPT ING PURCHASE HOUSE LOCALLY WHICH APPEARS"
        },
        {
            "cryptonym": "AMMUG",
            "context": "PAYMENT. 3. SEVERAL OTHER CRED IT CHECKS SINCE AMMUG/I EMPLOYED BY SCHEAFFER HAVE WORKED SMOOT HL Y. AMMUG/1 ATTEMPT ING PURCHASE HOUSE LOCALLY WHICH APPEARS SE REASON FOR PRESENT 1 SECRET 14-00000 SECRET PAGE"
        }
    ],
    "104-10234-10007.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ENVELOPE CONTAINING TWO LETTERS FOR LUIS AMADO-BLANCO (201-276972). ALSO PHOTOED, WILL POUCH. SECRET ન્ય AMLASH-1 ⑨ 14-00000 ! SECRET INT 315 ড্রি 5. D ON GOOD TERMS WITH ROLIO (XONTENEGRO) GUASP (M). PREPARING REPORT."
        }
    ],
    "104-10234-10050.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "Cl, cllop, Heyhill, SOD 6 SIG CEN DEFERRED ROUTINE MOB TO PARI WAVE INFOR INT IOS RPTS $s CI SI TYPIC AMLASH AMTRUNK SB PERS AR LOG CA BF SEC CITE DIR 83150 NS- וי REFS: A. UFGA 19569, 22 JAN 1965 (NOT SENT PARI)"
        },
        {
            "cryptonym": "AMLASH",
            "context": "VARIOUS SI TRAFFIC SINCE NAMES/PERSONS CAUGHT DURING LANDING PERIOD AND SHORTLY AFTER CITED THEREIN. AMLASH -1 file. RELEASING OFFICER 32 COORDINATING OFFICERS SECRET GROUP 1 Excluded from automatic downgrading"
        },
        {
            "cryptonym": "GPIDEAL",
            "context": "CITE DIR 83150 4. VIEW ABOVE, SUGGEST WAVE MAY WISH ATTEMPT PERSUADEsl 5.0 NOT TRY LOCATE A-9 VIA MRS. GPIDEAL OR MEXI PRESIDENT UNTIL AMLASH-1 AFTER RETURN CUBA ON 10 FEB HAS HAD TIME LOCATE A-9 VIA AMTRUNK-10,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SUGGEST WAVE MAY WISH ATTEMPT PERSUADEsl 5.0 NOT TRY LOCATE A-9 VIA MRS. GPIDEAL OR MEXI PRESIDENT UNTIL AMLASH-1 AFTER RETURN CUBA ON 10 FEB HAS HAD TIME LOCATE A-9 VIA AMTRUNK-10, AS CITED REF B. IF CASTRO'S SERVICES"
        },
        {
            "cryptonym": "AMLASH",
            "context": "MRS. A-9'S ATTEMPTS LOCATE HIM MAY ALERT THEM. 5. FOR PARI: SINCE A-9 MAY HAVE BEEN CAUGHT, PLS ASK AMLASH-1 TELL AMTRUNK-10 NOT TRY LOCATE A-9 VIA ANY OF FOLLOWING WEOM A-10 MAY KNOW: FISHERMAN CANDIDO DIAZ"
        }
    ],
    "104-10234-10069.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "PERS AR ΣΟΒ ETS LOG CA INFO ROME (PRIORITY) 22 H SEC S 201801 TO IMMEDIATE PARI DESERRITIVEJYPIC YOBITE AMLASH MHAPRON لشهر REF: PARI 8964 (IN 71838) For Autrich :.. 1. ACCORDING ROME 2136 (IN 40005) SUBJ REF IS"
        }
    ],
    "104-10234-10088.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ROUTING 5 6 7 8 17J165 2073 DOO DOP, ADDP, C/WE Z, C/CI, C/F12, VR, FILE 80565 INFO PARI DESERONIZEDYPIC AMLASH MHAPRON ANGABE HEF: WAVE 7531 (IN 67600) CONCUR ACTION PARA 3 REF. CITE DIR T 3 :: ... ני: SB SAR A"
        },
        {
            "cryptonym": "AMLASH",
            "context": "من الأر : END OF MESSAGE XPORTELA States Jwewlere who CONTACTED Hin MIAMI Hotel EARLY FALL 64 BEHALF AMLASH-1 AND APMWHIP-I. San 19tres DESMOND FITZGERALD C/WH WH/SA/EOB Katas WH/SA/MOB Hún Win WB/3 R. Pierre"
        }
    ],
    "104-10234-10102.txt": [
        {
            "cryptonym": "GPIDEAL",
            "context": "WIFE OF AMTRUNK-9 HAS ASKED FOR AND RECEIVED PERMISSION FROM TORRES TO WRITE A LETTER TO THE WIFE OF GPIDEAL PLEADING HER HUSBAND'S CASE. ATTACHMENT - USC WAVE MEMO TO ACSI DATED 19 JAN 65 DISTRIBUTION BY TAPE"
        }
    ],
    "104-10234-10115.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "CONCERNED ABOUT POSSIBLE REASSIGN- MENT SINCE HE NOT PARTICULAR FAVORITE OF CARRILLO AND WAS FRIEND OF AMLASH/1. 1 3. FOR BONN, ATTN MANGANELLO: RELEASING OFFICER 1 31-5 AMWHIP-2 (IDEN BONN ONLY) AMLASH-1 AUTHENTICATING"
        },
        {
            "cryptonym": "AMLASH",
            "context": "FRIEND OF AMLASH/1. 1 3. FOR BONN, ATTN MANGANELLO: RELEASING OFFICER 1 31-5 AMWHIP-2 (IDEN BONN ONLY) AMLASH-1 AUTHENTICATING OFFICER COORDINATING OFFICERS SECRET GROLIP 1 Excluded from automate deungracing ond"
        },
        {
            "cryptonym": "AMLASH",
            "context": "PERUMEN AUTHORITIES AND ANTONIO CARRILLO KNOWLEDGEABLE OF AMWHIP/2'S PAST BUSINESS ASSOCIATION WITH AMLASH/1. DURING 22 AND 23 MAR PHONE CONVERSATION BETWEEN AMWHIPS AND CARRILLO, LATTER GUARANTEED AMWHIP/2'S"
        },
        {
            "cryptonym": "AMLASH",
            "context": "QUESTION OF A POSSIBLE PROVOCATION ATTEMPT. THIS PARTICULARILY VALID SINCE ALL PARTIES CONTAMINATED BY PAST AMLASH/1 ASSOCIATION, AND DUE AMWEST/2'S STATEMENTS RE CURRENT AMWEST/1-CARRILLO RELATIONSHIP. 4. VIEW ABOVE"
        }
    ],
    "104-10234-10124.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "24-1 COORDINATING OFFICERS SECRET C/WEB GROUP I Encluded hors suro downgrading and decreserfication AMLASH-1 WILLIAM V. BROE C/WH AUTHENTICATING OFFICER COPY NO. 4 , 2 1"
        }
    ],
    "104-10234-10141.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "NEW RESTRICTIONS ALREADY IMPOSED FORBID THE BRINGING INTO CUBA RATIONED OR HARD-TO-GET DURABLE GOODS. AMLASH-1 AUTHENTICATING OFFICE COPY NO. RELEASING OFFICER COORDINATING OFFICERS SECRET REPRODUCTION BY OTHER"
        }
    ],
    "104-10234-10155.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "104-10234-10155 2025 RELEASE UNDER THE PRESIDENT JOHN F. KENNEDY ASSASSINATION RECORDS ACT OF 1992 AMLASH/1 - Paris Station Aspest Paris Station involvement with the ANLASH cass began in 1962, after AMLASH/1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH/1 - Paris Station Aspest Paris Station involvement with the ANLASH cass began in 1962, after AMLASH/1 cans to Paris after attending the Helsinki Youth Festival that year. In Helsinki, AMLASH/1 was contested"
        },
        {
            "cryptonym": "AMLASH",
            "context": "1962, after AMLASH/1 cans to Paris after attending the Helsinki Youth Festival that year. In Helsinki, AMLASH/1 was contested by UNRUMELE/? (an asset of the Paris Station who attended the Festival for purposes"
        },
        {
            "cryptonym": "AMLASH",
            "context": "KIMINGHAM (probably in alias although I know that ANLASH/L was at KIMINORAN's home upon socasion). In 1962 AMLASH/1 was given training in explosives by OHMX (I believe) upon request of the Paris Station. He appears"
        },
        {
            "cryptonym": "AMLASH",
            "context": "headquarters TYPIC officer, ONTRICH (F), arrived in Paris on 3 October 1963 and picked up the contact with AMLASH/1 which was being maintained by ANSFOR/L and MAK. The metings with AMLASH/I took place in a hom as best"
        },
        {
            "cryptonym": "AMLASH",
            "context": "picked up the contact with AMLASH/1 which was being maintained by ANSFOR/L and MAK. The metings with AMLASH/I took place in a hom as best I remember. These discussions concerned ANLASH/L'e plane to assiseinste"
        },
        {
            "cryptonym": "AMLASH",
            "context": "such blessing was given. MAST/1 returned to P on 27 Bovenber 1963. It was during this visit to Paris AMLASH -1 14-00000 2. that STOCKFOOD But AS/And, presbly in alias but I do not know the Getails. It was ales"
        },
        {
            "cryptonym": "AMLASH",
            "context": "some extent of ANLASR/L plans (Unser had been reord ted by KUBARK at that time). It was agreed that AMLASH/I would and the address of task/13's parents for a/e lettere to KUMARK (UNSKAPU/23 is wife of UNBNAFU/9)."
        }
    ],
    "104-10247-10064.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "(201-353093) WHO GAVE HIM FOUR LETTERS WHICH COULD NOT SAFELY OPEN. POUCHING NAMES ADDRESSEES. TUTINO TOLD D AMLASH/1 AND ANTRUNK/10 CERTAINLY GUILTY. BUT F LETTER SUGGESTING CLEMENCY CAUSED RUMORS OF PRIOR DEAL. ALSO"
        }
    ],
    "104-10247-10097.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "Background Use Only Do Not Reproduce 15 February 1965 MEMORANDUM FOR THE RECORD SUBJECT: Neeting with AMLASH-1 in Paris, 31 January to 3 February 1965 1. AMLASH-1 returned from Rome to Paris on 31 Jan 1965 and"
        },
        {
            "cryptonym": "AMLASH",
            "context": "MEMORANDUM FOR THE RECORD SUBJECT: Neeting with AMLASH-1 in Paris, 31 January to 3 February 1965 1. AMLASH-1 returned from Rome to Paris on 31 Jan 1965 and was net for a very brief meeting the same night by"
        },
        {
            "cryptonym": "AMLASH",
            "context": "discussed at the two meetings on 1 and 2 February 1965: The 2. The primary reason for again meeting AMLASH-1 before his planned return to Cuba was to brief him on the security implications involved in the infiltration"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Vedado Havana. Orozco's capture, if he has been captured, presents an indirect threat to the security of AMLASH-1 and a more direct threat to the security of ANTRUNK-10 since Orozco in Jan 1964 exfiltrated through"
        },
        {
            "cryptonym": "AMLASH",
            "context": "1964 exfiltrated through the rat line established by AMICE-14 (Miguelito). Upon his return to Cuba, AMLASH-1 will check the above with AMTRUNK-10; and, if Orozco is under the control of the security service,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "communicate with Miami whether ANLASH-1 and AMTRUNK-10 believe it necessary to exfiltrate ANTRUNK-10. AMLASH-1 was briefed to send a letter to (UNSNAFU-9 to indicate whether Orozco has been arrested or whether"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the above and any complications which have developed or may develop from Orozco's infiltration. b. AMLASH-1 suggested that his nom de guerre \"Charles,\" which we have been using for the past three years, be"
        },
        {
            "cryptonym": "AMLASH",
            "context": "\"Charles,\" which we have been using for the past three years, be changed to \"Gerardo.\" 14-00000 -2- c. AMLASH-1 was given a resupply of S/W developer pills and carbon. He planned to take the S/W material back with"
        },
        {
            "cryptonym": "AMLASH",
            "context": "how received from AMLASI-1 to either USNAFU-9 or letters that may be addressed to his parents-in-law. AMLASH-1 also agreed to send 8/ out in letters addressed to Juan Ventura (AMWHIP-I's business partner) in Geneva"
        },
        {
            "cryptonym": "AMLASH",
            "context": "partner) in Geneva or Rome. AMWHIP-I was briefed to inform Ventura that any letters he received from AMLASH-1 should be inmediately air mailed to ANTHIP-1 in New York. Since AHLASH-1 will probably find it necessary"
        },
        {
            "cryptonym": "AMLASH",
            "context": "any letter received from Cuba, addressed to him and signed by a person unknown to hir. S/W letters to AMLASH-1 should continue to be addressed to Ernestina Acosta, Edf. No. 526, Apt. 8, Esquina Calles 25 y H.)"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Ernestina Acosta, Edf. No. 526, Apt. 8, Esquina Calles 25 y H.) In an emergency a letter can also be sent to AMLASH-1's mother. d. AMLASH-1 was again debriefed on the cache that had been put down for him in Matanzas."
        },
        {
            "cryptonym": "AMLASH",
            "context": "Apt. 8, Esquina Calles 25 y H.) In an emergency a letter can also be sent to AMLASH-1's mother. d. AMLASH-1 was again debriefed on the cache that had been put down for him in Matanzas. He repeated what he had"
        },
        {
            "cryptonym": "AMLASH",
            "context": "in the AVE cable. A cable on this subject was sent from (Paris) to Headquarters, info WAVE, on 2 Feb. AMLASH-1 was requested to send a message either through his channel or through ANTRUNK-10's S/W chonnel reporting"
        },
        {
            "cryptonym": "AMLASH",
            "context": "reporting how much of the radio equipment and other material had been recovered from the cache. e. AMLASH-1 was asked if he knew of any individual in Cuba whom he could recruit and who could be inserted into"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Intelligence Service with the idea of attempting to get the DGI to assign this man to Caracas, Venezuela. AMLASH-1 could think of only one possibility, an individual known as Gustavo Gonzalez), AMLASH-1 has full confidence"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Caracas, Venezuela. AMLASH-1 could think of only one possibility, an individual known as Gustavo Gonzalez), AMLASH-1 has full confidence bin Gustavo and Gustavo) has previously been approached on several occasions by"
        },
        {
            "cryptonym": "AMLASH",
            "context": "has previously been approached on several occasions by Pinero to work for him. Upon his return to Cuba AMLASH-1 will check to find out if Gustavo can still get himself recruited by Pinero and then be sent on a"
        },
        {
            "cryptonym": "AMLASH",
            "context": "(AMWHIP-1, who also knows Gustavo) will provide the background infor mation upon his return to New York.) f. AMLASH-1 reported on the upcoming FEU elections on 10 February 1965. ANLASH-1 stated that Crombet, the president"
        },
        {
            "cryptonym": "AMLASH",
            "context": "from the factory to the port, and do they run the locomotives under their own power or are they towed. AMLASH-1 agreed to attempt to develop answers to the above requirements and pass the information to his contact"
        },
        {
            "cryptonym": "AMLASH",
            "context": "develop answers to the above requirements and pass the information to his contact in the Paris Station AMLASH-1 also agreed to attempt to find out and pass to the Paris Station) through (UNSNAFU-9 the names of"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the Cuban techs training at La Rochelle. h. In a general discussion regarding the persons with whom AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "discussion regarding the persons with whom AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1 stated he had received a letter from Portela and had in turn written"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 had been in contact either personally or through letters, AMLASH-1 mentioned Alfredo Portela. AMLASH-1 stated he had received a letter from Portela and had in turn written to Portela. He considers Portela"
        },
        {
            "cryptonym": "AMLASH",
            "context": "suggesting AVE send a S/W letter to AMTRUNK-10 stating: \"Este tranquilo. Carlos regresa pronto.\" k. AMLASH-1 was asked for information on the fol- lowing persons: (1) Samuel Gonzalez Rodriguez-Planes. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 was asked for information on the fol- lowing persons: (1) Samuel Gonzalez Rodriguez-Planes. AMLASH-1 reports he is a member of the Ameijeiras group and is a good and brave man. (2) Antonio Lusson y"
        },
        {
            "cryptonym": "AMLASH",
            "context": "independent and rare type individual who keeps to himself and doesn't involve himself in political matters. AMLASH-1 has heard nothing bad about lusson. : 14-00000 -4- (3) Cadte. Raul Diaz Arguelles, Chief of Artillery"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the request of Ambassador Carrillo. 1. Gastro enteritis, water pollution and unsanitary conditions. AMLASH-1 states there are no real problems, although the scarcity and lack of a balanced diet do cause some"
        },
        {
            "cryptonym": "AMLASH",
            "context": "water has been a problem which probably has been the cause of some of the sickness in the country. m. AMLASH-1 did not believe that Aragones had invited Thin to fly back to Havana with him in order to get him"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Thin to fly back to Havana with him in order to get him back because of any serious security matter. AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared"
        },
        {
            "cryptonym": "AMLASH",
            "context": "him back because of any serious security matter. AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 did state that Aragones was concerned that AMLASH-1 may not return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba."
        },
        {
            "cryptonym": "AMLASH",
            "context": "return to Cuba. Since Aragones cleared AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 for his trip abroad, he is in a way responsible that AMLASH-1 does not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "not defect and returns to Cuba. AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1 was unable to provide any information on the political developments"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 feels Aragones does not want any problems with Fidel in case AMLASH-1 decides to stay out. n. AMLASH-1 was unable to provide any information on the political developments in Cuba in mid-November and December"
        },
        {
            "cryptonym": "AMLASH",
            "context": "developments in Cuba in mid-November and December since he had been out of the country since early November. AMLASH-I was asked to check on the problems between the opposing factions in the Cuban leadership and explained"
        },
        {
            "cryptonym": "AMLASH",
            "context": "and plays & very small role in the political field. and very hard worker, one of the few, according to AMLASH-1, who has worked seven days a week without leave since the revolution. Emilio Aragones holds an important"
        },
        {
            "cryptonym": "AMLASH",
            "context": "been accused of organizing former 13th of March Revolutionary Directorate people, but, according to AMLASH-1, this probably based on the fact that Chomon always gives jobs in the ministry he heads to DR people."
        },
        {
            "cryptonym": "AMLASH",
            "context": "regime are Alberto Hora, Ambassador Carrillo and Jose Naranjo. He is serious Of all the ministries, १० AMLASH-1 and AMWHIP-1 were unable to develop any specifics, but from their conversations with Ambassador Carrillo"
        },
        {
            "cryptonym": "AMLASH",
            "context": "commercial/economic field, but a decision had not been made as of November 1964 as to location. 14-00000 তাল: -6- AMLASH-1 again reported that he feels Orlando Blanco, Consul of the Cuban Embassy in Bernpis approachable since"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Blanco, Consul of the Cuban Embassy in Bernpis approachable since he is unhappy with the Cuban regime. AMLASH-1 also feels that Enrique Rodriguez Loeches, Cuban Ambassador in Rabat is approachable if approached"
        },
        {
            "cryptonym": "AMLASH",
            "context": "ANLASH-1 feels is also approachable and feels money can be used as an inducement. Ambassador Carrillo, AMLASH-1 feels, if the proper person developed his, could probably be compromised with Fidel. He is a character"
        },
        {
            "cryptonym": "AMLASH",
            "context": "to Headquarters on the requirements on which he did provide information. cc: WII/SA/EOB מקוון File: AMLASH-1 201 Internal Op Nestor D. Sanchez WH/EA/AMWORLD :"
        }
    ],
    "104-10295-10001.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "August 1962 MEMORANDUM FOR THE RECORD SUBJECT: Summary of S/W Training and Issuance of Materials. AGENT: AMLASH/1 PLACE : Paris, France DATE : 17-22 August 1962 TRAINER: Richard M. Fallucci, TPE C/O. 1. AMLASH/1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AGENT: AMLASH/1 PLACE : Paris, France DATE : 17-22 August 1962 TRAINER: Richard M. Fallucci, TPE C/O. 1. AMLASH/1 was instructed in S/W techniques by the under- signed in a Paris Station safehouse on 17 and 18 August,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "S/W TRAINING, PARIS. 29 Quy 962 62 14-00000 AGENT S/W RECORD Date 29 August 1962 1. Agent Cryptonym: AMLASH/1 2. S supplies issued to the Agent (date and quantity): 2 sheets of carbon 5/1 paper #15136 and 48"
        },
        {
            "cryptonym": "AMLASH",
            "context": "next S/ message to him. -2- i 14-00000 AGENT S/W RECORD Date 29 August 1962 : ة 1. Agent Cryptonym: AMLASH/1 2. Si supplies issued to the igent (date and quantity): 2 sheets of carbon 3/4 paper #15136 and 48"
        }
    ],
    "104-10326-10098.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "SLUGS: WNINTEL REAM SUBJECT: REQUIREMENT FOR VZTOUCHDOWN REF: NONE TEXT: 1. SLANK/1 (ORIGINALLY ENCRYPTED AMMUG/1, 201- 749641) WAS ONE OF OUR EARLIEST CUBAN DEFECTORS. HE WAS A DGI OFFICER WHO DEFECTED 24 APRIL"
        }
    ],
    "104-10331-10149.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "be Assassination Records. A vote on releasing the tapes will be delayed until the May meeting. (S) 5. LITAMIL-9 a CIA Penetration of the Cuban Embassy. The identity of LITAMIL-9 was inadvertently released in 1993."
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "delayed until the May meeting. (S) 5. LITAMIL-9 a CIA Penetration of the Cuban Embassy. The identity of LITAMIL-9 was inadvertently released in 1993. He is now identified in true name as a CIA agent in John Newman's"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "is now identified in true name as a CIA agent in John Newman's book, Oswald and the CIA. As of 1993, LITAMIL-9 was still alive, living in Mexico city and he has family in Cuba. Up to now, the ARRB Board has agreed"
        }
    ],
    "104-10331-10152.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "and determine the sensitivity and provide detailed arguments in this regard. ISSUE 5 Protection of LITAMIL-9 11. (S) (LITAMIL-9 was a CIA penetration of the Cuban Embassy. Unfortunately, his identity was indirectly"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "sensitivity and provide detailed arguments in this regard. ISSUE 5 Protection of LITAMIL-9 11. (S) (LITAMIL-9 was a CIA penetration of the Cuban Embassy. Unfortunately, his identity was indirectly and inadvertently"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "he was identified in true name as a CIA agent in John Newman's book, Oswald and the CIA As of 1993, LITAMIL-9 was still alive and living in (Mexico City with family in Cuba. To date, the ARRB Board has agreed to"
        }
    ],
    "104-10331-10166.txt": [
        {
            "cryptonym": "IJDECANTER",
            "context": "Rejected CIA request for reconsideration of previous decision to protect only the digraph of crypt IJDECANTER [asset, dead, identity and relationship with Agency exposed in Dec 1997 LA Times article]; 5. Rejected"
        }
    ],
    "104-10332-10000.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "F. KENNEDY ASSASSINATION RECORDS ACT OF 1992 SUBJECT: SECRET Pending ARRB (JFK Board) Issues 11. (S) LITAMIL-9 was a CIA penetration of the Cuban Embassy. Unfortunately, his identity was indirectly and inadvertently"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "he was identified in true name as a CIA agent in John Newman's book, Oswald and the CIA. As of 1993, LITAMIL-9 was still alive and living in Mexico City with family in Cuba. To date, the ARRB Board has agreed to"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "proposal to postpone release of specific information until 2017 and use generic substitute language. 2) LITAMIL-9 (CIA penetration of Cuban Embassy in Mexico City/considered a \"key player\" in the Oswald-Mexico agreed"
        },
        {
            "cryptonym": "AMLASH",
            "context": "contains no other JFK assassination related information. 6) Carlos Tepedino [CIA asset/ key figure in AMLASH-Cubela plot to kill Castro/true name and role in story has been publicly known for years): voted to"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "transcribe) and determine the sensitivity and provide detailed arguments in this regard. ISSUE 5 Protection of LITAMIL-9 5 (S) The scope of this request is quite significant; it includes five boxes of 185 tapes from operations"
        }
    ],
    "104-10332-10002.txt": [
        {
            "cryptonym": "IJDECANTER",
            "context": "Director Lee S. Strickland Chief, Information Review Group Central Intelligence Agency Protection of IJDECANTER Cryptonym 1. (S) This memorandum responds to the Assassination Records Review Board (“ARRB\" or \"Board\")"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "certain very limited information in one document specifically, the actual cryptonym of a CIA source (IJDECANTER). It is our considered judgment that the release of this cryptonym, in the particular context of the"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "memorandum also proposes a substitution of a fictitious cryptonym (e.g., “TRUSTED\") for the actual cryptonym IJDECANTER in this or any other document where it appears and would otherwise be releasable. . 3. (U) As a preliminary"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "entirety. The released version reports that a Soviet official (Boris ZHURAVLEV) had provided Protection of IJDECANTER Cryptonym information to the effect that OSWALD was a KGB source. It continues by stating that CIA did"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "that this CIA assessment is supported by reporting from another source (identity_redacted_but, in fact, IJDECANTER). It concludes_by stating that this source (IJDECANTER) has had his \"... bona fides fully established"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "another source (identity_redacted_but, in fact, IJDECANTER). It concludes_by stating that this source (IJDECANTER) has had his \"... bona fides fully established (by CIA).\" It is this final fact which is -- ... established\""
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "to our request. By having released this substantive information \"bona fides and by otherwise having IJDECANTER known to the public in true name and crypt, we must protect the cryptonym here so that the key intelligence"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "espionage case. The information compromised was a seemingly innocuous operational manual for a Protection of IJDECANTER Cryptonym satellite. What the Soviets were able to deduce was devastating to American intelligence."
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "substantially released document and the Los Angeles Times article. The Russians know that Sergei PAPUSHIN (i.e., IJDECANTER) defected to the United States; they know or suspect what he told the US; they know or suspect that"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "effort against the Soviet Union and our entire CI program for a substantial period of time. Protection of IJDECANTER Cryptonym 11. (S) In sum, question 4 bona fides is the CI key. The CIA to date has released all of the"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "bona fides is the CI key. The CIA to date has released all of the substantive information relating to IJDECANTER in this particular document. But we must protect his cryptonym here, in this particular document, if"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "with insights into our capability to assess the bona fides of defectors. The Russian service knows if IJDECANTER was real; the CIA does not know this for certain. And third, there is an equitable issue. The CIA has"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "minimal, not critical to the public understanding, and arguably harmful to living persons. Protection of IJDECANTER Cryptonym 13. (U) I would be pleased to appear before the Board in person to respond to any particular"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "questions and am hopeful that this important information can be postponed from public release. Protection of IJDECANTER Cryptonym OIM/IRG/LSS: blo/31287 (6 August 1998) Distribution: Orig Adse EXDIR ER D/OCA D/OPA Principal"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "DI/IRO DST/IRO LSS signer file OIM/IRG Chrono Subject File: ARRB CIA TALKING POINTS re Protection of \"IJDECANTER\" Cryptonym Before the Assassination Records Review Board (ARRB) 26 AUGUST 1998 • The ADDO Jim Pavitt"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "certain very limited information in one document specifically, the actual cryptonym of a CIA source IJDECANTER). It is our considered judgment that the release of this cryptonym, in the particular context of the"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "propose however: • a substitution of a fictitious cryptonym (e.g., \"TRUSTED\") for the actual cryptonym IJDECANTER in this or any other document where it appears and would otherwise be releasable, and/or, • • if desired,"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "that this CIA assessment is supported by reporting from another source (identity redacted but, in fact, IJDECANTER) It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "another source (identity redacted but, in fact, IJDECANTER) It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established [by CIA].\" It is this final fact which is critical. --"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "having released this substantive information \"bona fides ... established\" -- AND by otherwise having IJDECANTER known to the public in true name and_crypt, THEN WE MUST PROTECT the cryptonym here so that the key"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "released document and the Los Angeles Times article. • The Russians know that Sergei PAPUSHIN (i.e., IJDECANTER) defected to the United States; • they know or suspect what he told the US; • • • they know or suspect"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "fides is the CI key. • • The CIA to date has released all of the substantive information relating to IJDECANTER in this particular document. But we must protect his cryptonym here, in this particular document, if"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "media. • There is additional damage that will accrue from not officially protecting the identity of IJDECANTER. • Any unilateral violation of a clandestine trust has a devastating, compounding consequence for an"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "with insights into our capability to assess the bona fides of defectors. The Russian service knows if IJDECANTER was real; the CIA does not know this for certain. • THIRD, is an equitable issue. • • The CIA has never"
        }
    ],
    "104-10332-10023.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "unless the context is clearly not related or the information is outside the appropriate time period: • • AMLASH AMMUG Maurice Bishop (any reference) Silvia, Duran 3 14-00000 • • Richard Gibson and the Free Cuba Committee"
        },
        {
            "cryptonym": "AMMUG",
            "context": "context is clearly not related or the information is outside the appropriate time period: • • AMLASH AMMUG Maurice Bishop (any reference) Silvia, Duran 3 14-00000 • • Richard Gibson and the Free Cuba Committee"
        }
    ],
    "104-10335-10001.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "LICOMET-2 LNERGO LNPURE LIRING-3 LICOAXES LITEMPO-12 LIQUIFIER LIROBBIN-1 LNGOLD WOFIRM AMOT-2 LITAMIL-7 LITAMIL-9 ERTHYROID-1 KMULCER ZRERASE KUCLUB AEGENERATE LICASA-1 LITAINTS SECRET MAY 30.95 11:51AM SECRET ARRB"
        }
    ],
    "104-10336-10034.txt": [
        {
            "cryptonym": "IJDECANTER",
            "context": "Review Board Lee S. Strickland Chief, Information Review Group Central Intelligence Agency Protection of IJDECANTER Cryptonym 1. (S) The CIA Deputy Executive Director has asked that I respond to the Assassination Records"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "certain very limited information in one document specifically, the actual cryptonym of a CIA source (IJDECANTER). It is our considered judgment that the release of this cryptonym, in the particular context of the"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "also proposes a substitution of a fictitious cryptonym (e.g., “TRUSTED”) for the actual cryptonym : IJDECANTER in this or any other document where it appears and would otherwise be releasable. 3. (U) As a preliminary"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "C/IRG/OIM CL Reason: 1.5(c) Dect On: X1 Dry From: HUM 4-82 SECRET 13-00000 SECRET SUBJECT: (S) Protection of IJDECANTER Cryptonym It information to the effect that OSWALD was a KGB source. continues by stating that CIA did"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "that this CIA assessment is supported by reporting from another source (identity redacted but, in fact, IJDECANTER). It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "another source (identity redacted but, in fact, IJDECANTER). It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established [by CIA].\" It is this final fact which is -- critical"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "request. By having released this substantive information \"bona fides established\" and by otherwise having IJDECANTER known to the public in true name and crypt, we ... must protect the cryptonym here so that the key intelligence"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "was a seemingly innocuous operational manual for a 2 SECRET 13-00000 SECRET SUBJECT: (S) Protection of IJDECANTER Cryptonym satellite. What the Soviets were able to deduce was devastating to American intelligence."
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "substantially released document and the Los Angeles Times article. The Russians know that Sergei PAPUSHIN (i.e., IJDECANTER) defected to the United States; they know or suspect what he told the US; they know or suspect that"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "entire CI program for a substantial period of time. 3 SECRET 13-00000 SUBJECT: SECRET (S) Protection of IJDECANTER/Cryptonym bona fides -- 11. (S) In sum, question 4 is the CI key. The CIA to date has released all of"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "question 4 is the CI key. The CIA to date has released all of the substantive information relating to IJDECANTER in this particular document. But we must protect his cryptonym here, in this particular document, if"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "with insights into our capability to assess the bona fides of defectors. The Russian service knows if IJDECANTER was real; the CIA does not know this for certain. And third, there is an equitable issue. {The CIA has"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "understanding, and arguably harmful to living persons. 4 SECRET 13-00000 SUBJECT: SECRET (S) Protection of IJDECANTER Cryptonym 13. (U) I would be pleased to appear before the Board in person to respond to any particular"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "Strickland 5 SECRET 13-00000 SECRET Office of OIM Information Management CIA TALKING POINTS re Protection of \"IJDECANTER\" Cryptonym Before the Assassination Records Review Board (ARRB) 26 AUGUST 1998 • The ADDO Jim Pavitt"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "certain very limited information in one document specifically, the actual cryptonym of a CIA source (IJDECANTER). It is our considered judgment that the release of this cryptonym, in the particular context of the"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "propose however: • a substitution of a fictitious cryptonym (e.g., \"TRUSTED\") for the actual cryptonym (IJDECANTER in this or any other document where it appears and would otherwise be releasable, and/or, SECRET CL"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "that this CIA assessment is supported by reporting from another source (identity redacted but, in fact, IJDECANTER). It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "another source (identity redacted but, in fact, IJDECANTER). It concludes by stating that this source (IJDECANTER) has had his \"... bona fides fully established [by CIA].\" It is this final fact which is critical. --"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "By having released this substantive information \"bona fides ... established\" AND by otherwise having IJDECANTER known to the public in true name and crypt, THEN WE MUST PROTECT the cryptonym here so that the key"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "released document and the Los Angeles Times article. • The Russians know that Sergei PAPUSHIN (i.e., IJDECANTER) defected to the United States; • they know or suspect what he told the US; • • • they know or suspect"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "bona fides is the CI key. • The CIA to date has released all of the substantive information relating to IJDECANTER in this particular document. • But we must protect his cryptonym here, in this particular document,"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "media. • There is additional damage that will accrue from not officially protecting the identity of IJDECANTER • • • Any unilateral violation of a clandestine trust has a devastating, compounding consequence for"
        },
        {
            "cryptonym": "IJDECANTER",
            "context": "with insights into our capability to assess the bona fides of defectors. The Russian service knows if IJDECANTER was real; the CIA does not know this for certain. • THIRD, is an equitable issue. • The CIA has never"
        }
    ],
    "104-10337-10001.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "castigated CIA for \"lying\" to the Warren Commission. The particular example offered had to do with \"AMLASH.\" This individual came up in connection with traces the Agency apparently conducted for the Warren Commission."
        },
        {
            "cryptonym": "AMLASH",
            "context": "traces the Agency apparently conducted for the Warren Commission. CIA purportedly had a relationship with AMLASH in connection with a Castro assassination plot, but did not make this fact known to the Warren Commission."
        }
    ],
    "157-10002-10087.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "ASSASSINATION CASTRO MAFIA SPECIAL GROUP BISSELL, LANSDALE, EDWARD HARVEY OPERATION MONGOOSE ZOGBEY POISON AMLASH 5412 COMMITTEE ZRRIFLE TASK FORCE W MAHEU, ROBERT DOCUMENT TYPE: PAPER, TEXTUAL DOCUMENT CLASSIFICATION"
        }
    ],
    "157-10005-10297.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "(I.G., p. 75). Helms testified that the diving suit never left the laboratory (Helms, 6/13, p. 135). (e) AMLASH (1) Origin of the Project In March 1961, an officer of the Mexico City CIA station met with a highly-placed"
        },
        {
            "cryptonym": "AMLASH",
            "context": "cooperate in efforts against the Castro regime (I.G., p. 78). The Cuban, referred to by the cryptonym AMLASH-1, had been *Donovan was not aware of the plan. NW 50955 DocId:32202487 Page 4 A CIA cable dated February"
        },
        {
            "cryptonym": "AMLASH",
            "context": "the plan. NW 50955 DocId:32202487 Page 4 A CIA cable dated February 2, 1965, stated that B-l had given AMLASH-1 a silencer and that AMLASH-1 had \"small, highly concentrated explosives.\" On February 11, 1965 the"
        },
        {
            "cryptonym": "AMLASH",
            "context": "DocId:32202487 Page 4 A CIA cable dated February 2, 1965, stated that B-l had given AMLASH-1 a silencer and that AMLASH-1 had \"small, highly concentrated explosives.\" On February 11, 1965 the Madrid Station cabled that AMLASH-1"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AMLASH-1 had \"small, highly concentrated explosives.\" On February 11, 1965 the Madrid Station cabled that AMLASH-1 would soon receive \"one pistol with silencer and one FAL rifle with a silencer from B-l's secretary\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "reported that \"B-1 had three packages of special items made up by his technical people and delivered to AMLASH-1 in Madrid\" (I.G., p. 103 In June 1965, CIA terminated all contact with AMLASH-1 and his associates"
        },
        {
            "cryptonym": "AMLASH",
            "context": "people and delivered to AMLASH-1 in Madrid\" (I.G., p. 103 In June 1965, CIA terminated all contact with AMLASH-1 and his associates because of reports that his activities were widely known (I.G., pp. 104-105). \"4."
        }
    ],
    "157-10008-10238.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "you know, during October and November assassination devices were being prepared and were offered to AMLASH. You ought to at least see from the documents and from taking some single-Senator testimony from Attwood"
        },
        {
            "cryptonym": "AMLASH",
            "context": "whether there was a genuine effort to make peace; if so, was that communicated to the Agency? Was the AMLASH assassination effort consistent? In the telephone conversation I had with Arthur Schlesinger he said"
        }
    ],
    "157-10008-10253.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "V. p. 79 In mid-1965 the CIA interrogated Tepedino, New York jeweler who had been involved with the AMLASH operation from the beginning. The report concluded that the subject was deceptive during the interrogation"
        },
        {
            "cryptonym": "AMLASH",
            "context": "pertinent information in one or more relevant areas. Tepedino lied in response to questions dealing with AMLASH's and his ties to Cuban intelligence. Tepedino stated chat AMLASH had no plan to over- throw Castro."
        },
        {
            "cryptonym": "AMLASH",
            "context": "response to questions dealing with AMLASH's and his ties to Cuban intelligence. Tepedino stated chat AMLASH had no plan to over- throw Castro. Tepedino stated AMLASH had strong connections with Cuban intelligence"
        },
        {
            "cryptonym": "AMLASH",
            "context": "to Cuban intelligence. Tepedino stated chat AMLASH had no plan to over- throw Castro. Tepedino stated AMLASH had strong connections with Cuban intelligence and was probably cooperating with it in various ways."
        },
        {
            "cryptonym": "AMLASH",
            "context": "strong connections with Cuban intelligence and was probably cooperating with it in various ways. Although AMLASH never mentioned these connections to his CIA case officers: Teledino stated chat AMLASH had mentioned"
        },
        {
            "cryptonym": "AMLASH",
            "context": "ways. Although AMLASH never mentioned these connections to his CIA case officers: Teledino stated chat AMLASH had mentioned them to him and almost everyone else he had met. NW 47129 DocId: 32203761 Page 2 Book"
        },
        {
            "cryptonym": "AMLASH",
            "context": "On November 24, Mexico City cabled the names of known contacts of Soviet personnel in Mexico City and AMLASH's name (Rolando Cubela) was included on that list. Nonetheless neither Fitzgerald, Helms, Tom K or Angleton"
        }
    ],
    "157-10011-10005.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED: (232) 15-3-94 PERSONS/ENTITIES: Desmond FITZGERALD AMLASH Nestor SANCHEZ Robert KENNEDY HELMS DATES: Oct. 29, 1963 Castro Nov. 13, 1963 TOP SECRET OCCURRENCE:"
        },
        {
            "cryptonym": "AMLASH",
            "context": "1963 TOP SECRET OCCURRENCE: (CARD 1) CATEGORIES: Cand 1 of 2 Desmond FITZGERALD, Chief of SAS, met with AMLASH, using Nestor SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy of which is in the AMLASH file,\" (89) read as follows: \"FITZGERALD will represent self as personal representative of Robert F."
        },
        {
            "cryptonym": "AMLASH",
            "context": "self as personal representative of Robert F. KENNEDY who traveled Paris for specific purpose meeting (AMLASH) and giving him assurances of full U.S. support if there is change of the present government in Cuba.\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "STAFF: F Baron DATE: 7/1/75 NW 50955 DocId: 32203773 Page 17 : PERSONS/ENTITIES: SANCHEZ FITZGERALD AMLASH OCCURRENCE: (CARD 2) DATES: Oct. 29, 1963 Nov. 13, 13 131963 1963 11 CATEGORIES: Castro Cand 2 of 2"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Cand 2 of 2 In a memorandum by SANCHEZ on November 13, 1963, it was reported that \"FITZGERALD informed (AMLASH) that the U.S. is prepared to render all necessary assistance to any anti-Communist Cuban group which"
        },
        {
            "cryptonym": "AMLASH",
            "context": "\"nothing of an operational nature was discussed at the FITZGERALD meeting (90), FITZGERALD recalled that AMLASH-1 \"spoke_repeatedly_of_the_need for an assassination-weapon. In particular, he wanted a high-powered"
        },
        {
            "cryptonym": "AMLASH",
            "context": "some other weapon that could be used to kill Castro from a distance.\" (90) FITZGERALD said that he told AMLASH \"that the U.S. Government would have no part of an attempt on CASTRO's life. (90) was satisfied with"
        },
        {
            "cryptonym": "AMLASH",
            "context": "with the policy discussion but now them However, the SANCHEZ memorandum reported \"After the meeting AMLASH stated that he we could provide him.\"(90) SOURCE: IG REPORT 1967 FILE: TOP slied to know what technical"
        },
        {
            "cryptonym": "AMLASH",
            "context": "support STAFF: FBaron DATE: 7/1/75 NW 50955 DocId:32203773 Page 18. PERSONS/ENTITIES: Desmond FITZGERALD/ AMLASH Nestor SANCHEZ CIA HAS NO OBJECTION TO DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SECRET Robert KENNEDY HELMS OCCURRENCE: (CARD 1) Card 1 of 2 Desmond FITZGERALD, Chief of SAS, met with AMLASH, using Nestor. Nestor SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy of which is in the AMLASH file,\" (89) read as follows: Robert F. KENNEDY حمد \"FITZGERALD will represent self as personal representative"
        },
        {
            "cryptonym": "AMLASH",
            "context": "represent self as personal representative of Robert F. who traveled Paris for specific purpose meeting (AMLASH) and giving him assurances of full U.S. support if there is change of the present government in Cuba.\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "FILE: STAFF: F Baron DATE: 7/1/75 NW 50955 DocId:32203773 Page 19 PERSONS/ENTITIES: CANCHEZ FITZGERALD AMLASH OCCURRENCE: (CARD 2) DATES: Oct. 29,/1963 Nov. 12, 1963 CATEGORIES: Castro Cand 2 of 2 In a memorandum"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Cand 2 of 2 In a memorandum by SANCHEZ on November 13, 1963, it was reported that \"FITZGERALD informed (AMLASH) that the U.S. is prepared to render all necessary assistance to any anti-Communist Cuban group which"
        },
        {
            "cryptonym": "AMLASH",
            "context": "\"nothing of an operational nature was discussed at the FITZGERALD meeting (90), FITZGERALD recalled that AMLASH-1 \"spoke_repeatedly_of_the_need_for_an_assassination-weapon. In particular, he wanted a high-powered"
        },
        {
            "cryptonym": "AMLASH",
            "context": "some other weapon that could be used to kill Castro from a distance.\" (90) FITZGERALD said that he told AMLASH \"that the U.S. Government would have no part of an attempt on CASTRO's life. (90) However, the SANCHEZ"
        },
        {
            "cryptonym": "AMLASH",
            "context": "part of an attempt on CASTRO's life. (90) However, the SANCHEZ memorandum reported \"After the meeting AMLASH) stated that he was satisfied with with the policy discussion but nowed to know stated that port we"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED 15-3-94 PERSONS/ENTITIES: WAINWRIGHT TEREDENO FITZGERALD AMLASH OCCURRENCE: DATES: November 14,1963 Castro CATEGORIES: WAINWRIGHT met with TEPEDINO, who reported to"
        },
        {
            "cryptonym": "AMLASH",
            "context": "OCCURRENCE: DATES: November 14,1963 Castro CATEGORIES: WAINWRIGHT met with TEPEDINO, who reported to him AMLASH's reaction to his meeting with FITZGERALD. TEPEDINO said that AMLASH dwelt constantly on the fact that"
        },
        {
            "cryptonym": "AMLASH",
            "context": "with TEPEDINO, who reported to him AMLASH's reaction to his meeting with FITZGERALD. TEPEDINO said that AMLASH dwelt constantly on the fact that \"he could not understand why he was denied certain small pieces of"
        },
        {
            "cryptonym": "AMLASH",
            "context": "exile groups for their ineffective excursions against Cuban coastal targets. According to TEPEDINO, AMLASH) feels strongly on this point, and if he does not get advice and materials from a U.S. Government technician,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "1967 TOP SECRET STAFF: F Baron DATE: 7/1/75 NW 50955 DocId:32203773 Page 21 PERSONS/ENTITIES: SANCHEZ AMLASH FITZGERALD✓ CIA HAS NO OBJECTION TO DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED 15-3-94"
        },
        {
            "cryptonym": "AMLASH",
            "context": "OCCURRENCE: Nestor SANCHEZ prepared a memorandum for the Record which indicated that the CIA would give AMLASH assassination weapons: \"C/SAS (FITZGERALD) approved telling (AMLASH) he would be given a cache inside"
        },
        {
            "cryptonym": "AMLASH",
            "context": "indicated that the CIA would give AMLASH assassination weapons: \"C/SAS (FITZGERALD) approved telling (AMLASH) he would be given a cache inside Cuba. Cache could, if he requested it, include..\" high power rifles"
        },
        {
            "cryptonym": "AMLASH",
            "context": "could, if he requested it, include..\" high power rifles W/scopes.....C/SAS requested written reports on AMLASH operation be_kept-to-a-minimum.\" (91) (Emphasis-added) Note: There are sniper/assessin weapons, TOP"
        },
        {
            "cryptonym": "AMLASH",
            "context": "OBJECTION TO DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED 15-3-96 PERSONS/ENTITIES: SANCHEZ AMLASH FITZGERALD OCCURRENCE: DATES: Νον. 22, 1963 Castro CATEGORIES: Nester SANCHEZ, met with AMLASH in Paris"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SANCHEZ AMLASH FITZGERALD OCCURRENCE: DATES: Νον. 22, 1963 Castro CATEGORIES: Nester SANCHEZ, met with AMLASH in Paris and gave him an assassination device (a ball- point pen rigged as a hypodermic syringe for"
        },
        {
            "cryptonym": "AMLASH",
            "context": "telling him that everything was off.\" (94) But, the IG REPORT authors did not find such a cable in the AMLASH file. (94) SOURCE: FILE: TO REPORT TOP SECRET STAFF: F Baron 7/1/75 DATE: NW 50955 DocId: 32203773 Page"
        }
    ],
    "157-10011-10006.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "THIS DOCUMENT AS SANITIZED 11-4-94 DATES: Samuel HALPERN Nov. 20, 1963 Castro PERSONS/ENTITIES: SANCHEZ AMLASH Dr. Edward GUNN CATEGORIES: OCCURRENCE: SANCHEZ reported that although AMLASH had wanted \"a high-powered,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "PERSONS/ENTITIES: SANCHEZ AMLASH Dr. Edward GUNN CATEGORIES: OCCURRENCE: SANCHEZ reported that although AMLASH had wanted \"a high-powered, silenced rifle with an effective range of hundreds or thousands of yards,\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "THIS DOCUMENT AS SANITIZED 11-4-94 DATES: Samuel HALPERN Nov. 20, 1963 Castro PERSONS/ENTITIES: SANCHEZ AMLASH Dr. Edward GUNN CATEGORIES: OCCURRENCE: SANCHEZ reported that although AMLASH had wanted \"a high-powered,"
        },
        {
            "cryptonym": "AMLASH",
            "context": "PERSONS/ENTITIES: SANCHEZ AMLASH Dr. Edward GUNN CATEGORIES: OCCURRENCE: SANCHEZ reported that although AMLASH had wanted \"a high-powered, silenced rifle with an effective range of hundreds or thousands of yards,\""
        }
    ],
    "157-10011-10008.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "DATE: June 30, 1975 NW 50955 DocId: 32203776 Page 19 PERSONS/ENTITIES: Necter SANCHEZ Robert F. KENNEDY AMLASH-1 OCCURRENCE: CIA HAS NO OBJECTION TO DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Castro Nestor SANCHEZ (a Spanish-speaking case officer from Headquarters acting as case officer for AMLASH-1) cabled that AMLASH-1 \"was insistent upon meeting with a senior U.S. official, preferably Robert F."
        },
        {
            "cryptonym": "AMLASH",
            "context": "(a Spanish-speaking case officer from Headquarters acting as case officer for AMLASH-1) cabled that AMLASH-1 \"was insistent upon meeting with a senior U.S. official, preferably Robert F. KENNEDY, for assurances"
        },
        {
            "cryptonym": "AMLASH",
            "context": "a senior U.S. official, preferably Robert F. KENNEDY, for assurances of U.S. moral support\" (88)-for-AMLASH-s-activities-in-Guba. SANCHEZ recommended-that-\"Highest- and profound consideration be given\" (88) because"
        },
        {
            "cryptonym": "AMLASH",
            "context": "(88)-for-AMLASH-s-activities-in-Guba. SANCHEZ recommended-that-\"Highest- and profound consideration be given\" (88) because AMLASH-1 was determined to attempt an operation against Castro \"with or without U.S. support\" (88). SOURCE:"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED 10 Dec 93... Je (1) (A) CATEGORIES: Desmond FITZGERALD AMLASH Nestor SANCHEZ Robert KENNEDY HELMS Oct. 29, 1963. Castro Nov. 13, 1963 TOP SECRET OCCURRENCE: (CARD"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Nov. 13, 1963 TOP SECRET OCCURRENCE: (CARD 1) Cand 1 of 2 Desmond FITZGERALD, Chief of SAS, met with AMLASH, using Nestor SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy of which is in the AMLASH file,\" (89) read as follows: \"FITZGERALD will represent self as personal representative of Robert F."
        },
        {
            "cryptonym": "AMLASH",
            "context": "self as personal representative of Robert F. KENNEDY who traveled Paris for specific purpose meeting (AMLASH) and giving him assurances of full U.S. support if there is change of the present government in Cuba.\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "FILE: STAFF: F Baron DATE: 7/1/75 NW 50955 DocId:32203776 Page 21 PERSONS/ENTITIES: SANCHEZ FITZGERALD AMLASH OCCURRENCE: (CARD 2) DATES: CATEGORIES: Nov. 13 Oct. 29,/1963 131963 12 1963 Castro Cand 2 of 2 \" In"
        },
        {
            "cryptonym": "AMLASH",
            "context": "2 of 2 \" In a memorandum by SANCHEZ on November 13, 1963, it was reported that \"FITZGERALD informed (AMLASH) that the U.S. is prepared to render all necessary assistance to any anti-Communist Cuban group which"
        },
        {
            "cryptonym": "AMLASH",
            "context": "\"nothing of an operational nature was discussed at the FITZGERALD meeting (90), FITZGERALD recalled that AMLASH-1 \"spoke repeatedly of the need for an assassination weapon. In particular, he wanted a high-powered"
        },
        {
            "cryptonym": "AMLASH",
            "context": "some other weapon that could be used to kill Castro from a distance.\" (90) FITZGERALD said that he told AMLASH \"that the U.S. Government would have no part of an attempt on CASTRO's life. (90) However, the SANCHEZ"
        },
        {
            "cryptonym": "AMLASH",
            "context": "part of an attempt on CASTRO's life. (90) However, the SANCHEZ memorandum reported \"After the meeting (AMLASH stated that he was satisfied with the policy discussion but we could provide him.\"(90) now esined to"
        },
        {
            "cryptonym": "AMLASH",
            "context": "AND/OR RELEASE CFTHIS DOCUMENT AS SANITIZED de (1)(A) 113 D 93. PERSONS/ENTITIES: Desmond FITZGERALD AMLASH Nestor SANCHEZ Robert KENNEDY HELMS DATES: Oct. 29, 1963 Nov. 13, 1963 TOP SECRET OCCURRENCE: (CARD"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SECRET OCCURRENCE: (CARD 1) Castro CATEGORIES: Cand 1 of 2 Desmond FITZGERALD, Chief of SAS, met with AMLASH, using Nestor SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy"
        },
        {
            "cryptonym": "AMLASH",
            "context": "SANCHEZ as interpreter. (88-89). The cover of the \"contact plan for the meeting, a copy of which is in the AMLASH file,\" (89) read as follows: \"FITZGERALD will represent self as personal representative of Robert F."
        },
        {
            "cryptonym": "AMLASH",
            "context": "self as personal representative of Robert F. KENNEDY who traveled Paris for specific purpose meeting (AMLASH) and giving him assurances of full U.S. support if there is change of the present government in Cuba.\""
        },
        {
            "cryptonym": "AMLASH",
            "context": "DATE: 7/1/75 NW 50955 DocId: 32203776 Page 27 PERSONS/ENTITIES: DATES: CATEGORIES: SANCHEZ FITZGERALD AMLASH OCCURRENCE: (CARD 2) Oct. 29,/1963 Nov. 13, 1963 Castro Cand 2 of 2 In a memorandum by SANCHEZ on November"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Cand 2 of 2 In a memorandum by SANCHEZ on November 13, 1963, it was reported that \"FITZGERALD informed (AMLASH) that the U.S. is prepared to render all necessary assistance to any anti-Communist Cuban group which"
        },
        {
            "cryptonym": "AMLASH",
            "context": "FITZGERALD meeting (90), FITZGERALD recalled that \"spoke-repeatedly-of-the-need-for-an-assassination_weapon. -AMLASH-1 In particular, he wanted a high-powered rifle with telescopic sights or some other weapon that could"
        },
        {
            "cryptonym": "AMLASH",
            "context": "some other weapon that could be used to kill Castro from a distance.\" (90) FITZGERALD said that he told AMLASH \"that the U.S. Government would have no part of an attempt on CASTRO's life. (90) However, the SANCHEZ"
        },
        {
            "cryptonym": "AMLASH",
            "context": "part of an attempt on CASTRO's life. (90) However, the SANCHEZ memorandum reported \"After the meeting (AMLASH stated that he was satisfied with the policy discussion but now d we could provide"
        }
    ],
    "180-10110-10100.txt": [
        {
            "cryptonym": "AMMUG",
            "context": "he was crazy, but I was always uncomfortable around him.\" Mr. Phillips also recognized the cryptonym AMMUG/1. \"I Mr. Phillips was shown CIA #3's 3665 and 3662 which are reports from AMMUG that the Cubans believed"
        },
        {
            "cryptonym": "AMMUG",
            "context": "recognized the cryptonym AMMUG/1. \"I Mr. Phillips was shown CIA #3's 3665 and 3662 which are reports from AMMUG that the Cubans believed that Calderon had been recruited by the CIA and had, therefore, called her"
        }
    ],
    "180-10113-10119.txt": [
        {
            "cryptonym": "AMLASH",
            "context": "him as \"the senior CIA officer charged with responsibility for Cuban affairs.\" He had a meeting with AMLASH on October 29, 1963 for a policy discussion, informing AMLASH that the U.S. was prepared to provide"
        },
        {
            "cryptonym": "AMLASH",
            "context": "Cuban affairs.\" He had a meeting with AMLASH on October 29, 1963 for a policy discussion, informing AMLASH that the U.S. was prepared to provide support for a Cuban uprising only after a real coup had.. been"
        }
    ],
    "180-10131-10329.txt": [
        {
            "cryptonym": "LITAMIL-9",
            "context": "the possible involve- 15 ment of the Cuban government? 16 Mr. Shaw. I did not handle LITAMIL-7, and LITAMIL-9. I 17 did handle, 18 Mr. Goldsmith. Who handled LITAMIL-7? 19 Mr. Shaw. I think that it was Ray Swider,"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "normal for any other case officer in the Cuban sec- tion to see my contact reports on meetings with LITAMIL-9. Mr. Goldsmith. In light of that, do you know what infor- mation LITAMIL-77gave concerning the Cuban"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "the specifics of anything. You may have something in your files with my name on it; I do not know what LITAMIL-9 produced. 12 I do have the recollection of the sense of feeling on the 12 14 15 part of those people"
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "of these 1 penetration agents? 5 Mr. Shaw. One of them was LITAMIL-7 L-I-T-A-M-I-L 7. The other was LITAMIL-9. 6 300 7TH STREET, S.W. REPORTERS BUILDING, WASHINGTON, D.C. 20024 (202) 554-2345 7 3 9 Mr. Goldsmith."
        },
        {
            "cryptonym": "LITAMIL-9",
            "context": "13 Mr. Shaw. That agent was an employee of the consular section of the Cuban Embassy in Mexico City. LITAMIL-9 was an 14 officer of the Embassy. 15 Mr. Goldsmith. Mr. Shaw, on the question of the identity 16 of"
        }
    ],
    "180-10143-10227.txt": [
        {
            "cryptonym": "GPFLOOR",
            "context": "him to explain the cover memo dated 12 December 1963 by Robert G. Lamprell to Chiefs of SR and WH re: GPFLOOR-Lee Harvey Oswald. 3 Casasin explained that Lamprell (whose real name was William Rober Sinclair he"
        }
    ]
}